Repository: wojtas26/octoprint
Catalog: messages.po
Languages: cs

source: Could not upload the file. Make sure that it is a valid file with one of these extensions: %(extensions)s
cs: Soubor nemohl být nahrán. Ujistěte se že jde o soubor s jednou z těchto přípon: %(extensions)s

source: Saving ...
cs: Ukládání...

source: Uploading ...
cs: Nahrávání...

source: Loading...
cs: Načítání...

source: Analyzing...
cs: Analyzování...

source: Analyzed
cs: Analyzováno

source: Estimated layer height
cs: Předpokládaná výška vrstvy

source: Estimated total print time
cs: Odhadovaný celkový čas tisku

source: Layers with extrusion
cs: Vrstvy s extruzí

source: Layer number
cs: Vrstva č.

source: Layer height
cs: Výška vrstvy

source: GCODE commands
cs: GCODE příkazy

source: Login
cs: Přihlášení

source: Logged in as %(name)s
cs: Přihlášen jako %(name)s

source: <p>It seems that you are connecting to OctoPrint over the public internet.</p><p>This is strongly discouraged unless you have taken proper network security precautions. Your printer is an appliance you really should not be giving access to everyone with an internet connection.</p><p><strong>Please see <a href="%(url)s" target="_blank" rel="noreferrer noopener">this blog post</a> for ways to safely access your OctoPrint instance from remote.</strong></p><p><small>If you know what you are doing or you are sure this message is mistaken since you are in an isolated LAN, feel free to ignore it.</small></p>
cs: <p>Vypadá to, že jste se připojili do OctoPrintu z veřejného internetu.</p><p>Toto se silně nedoporučuje, pokud jste nepřijali řádné bezpečnostní opatření v síti. Tiskárna je zařízení, ke kterému opravdu nemáte poskytovat přístup všem s připojením k internetu.</p><p><strong>Prosím podívejte se <a href="%(url)s" target="_blank" rel="noreferrer noopener">na tento příspěvek v blogu</a> na způsoby jak vzdáleně a bezpečně přistupovat do Vašeho OctoPrintu.</strong></p><p><small>Pokud víte co děláte, nebo jste v izolované siti LAN, můžete toto ignorovat.</small></p>

source: Possible external access detected
cs: Zjištěn možný přístup z vnějšku

source: Login successful
cs: Přihlášení úspěšné

source: You are now logged in as "%(username)s"
cs: Nyní jste přihlášen jako "%(username)s"

source: Login failed
cs: Přihlášení selhalo

source: User unknown or wrong password
cs: Neznámý uživatel nebo špatné heslo

source: Your account is deactivated
cs: Váš účet je deaktivován

source: Logout successful
cs: Odhlášení úspěšné

source: You are now logged out
cs: Jste nyní odhlášen

source: Identifier must be set
cs: Identifikátor musí být zvolen

source: Invalid characters, only a-z, A-Z, 0-9, -, ., _, ( and ) are allowed
cs: Nepovolený znak, pouze a-z, A-Z, 0-9, -, ., _, ( a ) jsou povoleny

source: A profile with such an identifier already exists
cs: Profil se stejným jménem už existuje

source: default
cs: výchozí

source: red
cs: červená

source: orange
cs: oranžová

source: yellow
cs: žlutá

source: green
cs: zelená

source: blue
cs: modrá

source: black
cs: černá

source: Lower Left
cs: Dole vlevo

source: Center
cs: Uprostřed

source: There was unexpected error while saving the printer profile, please consult the logs.
cs: Nastal nečekaný problém při ukládání profilu tiskárny, prosím zkontrolujte log soubory.

source: Could not add profile
cs: Profil nemohl být přidán

source: Cannot delete the default profile or the currently active profile.
cs: Není možné smazat výchozí nebo aktuálně nastavený profil

source: There was unexpected error while removing the printer profile, please consult the logs.
cs: Nastal nečekaný problém při odebírání profilu tiskárny, prosím zkontrolujte log soubory.

source: Could not delete profile
cs: Profil nemohl být smazán

source: You are about to delete the printer profile "%(name)s".
cs: Opravdu chceš smazat profil tiskárny "%(name)s".

source: There was unexpected error while updating the printer profile, please consult the logs.
cs: Nastal nečekaný problém při aktualizování profilu tiskárny, prosím zkontrolujte log soubory.

source: Could not update profile
cs: Profil nemohl být upraven

source: Add Printer Profile
cs: Přidat profil tiskárny

source: Edit Printer Profile "%(name)s"
cs: Upravit profil tiskárny "%(name)s"

source: Restarts the print job from the beginning
cs: Znovu spustí tisk od úplného začátku

source: Starts the print job
cs: Spustí tisk

source: Resumes the print job
cs: Obnoví tisk

source: Pauses the print job
cs: Pozastaví tisk

source: Still stabilizing...
cs: Stále se stabilizuje...

source: Based on a linear approximation (very low accuracy, especially at the beginning of the print)
cs: Na základě lineární aproximace (velmi nízká přesnost, zejména na začátku tisku)

source: Based on the estimate from analysis of file (medium accuracy)
cs: Na základě odhadu dle analýzy souboru (střední přesnost)

source: Based on a mix of estimate from analysis and calculation (medium accuracy)
cs: Na základě odhadu z analýzy a výpočtu (střední přesnost)

source: Based on the average total of past prints of this model with the same printer profile (usually good accuracy)
cs: Na základě průměrné doby posledních tisků tohoto modelu a stejného tiskového profilu (obvykle dobrá přesnost)

source: Based on a mix of average total from past prints and calculation (usually good accuracy)
cs: Na základě kombinace průměrné doby posledních tisků a výpočtu (obvykle dobrá přesnost)

source: Based on the calculated estimate (best accuracy)
cs: Na základě vypočteného odhadu (nejlepší přesnost)

source: Continue
cs: Pokračovat

source: Pause
cs: Pauza

source: On Z Change
cs: Při změně "Z" osy

source: Timed
cs: Časovaně

source: This will restart the print job from the beginning.
cs: Toto znovu spustí tisk od úplného začátku.

source: This will cancel your print.
cs: Toto zruší tvůj tisk.

source: No
cs: Ne

source: Yes
cs: Ano

source: violet
cs: fialová

source: white
cs: bílá

source: Autodetect from browser
cs: Načíst z nastavení prohlížeče

source: If you see your webcam stream below, the entered stream URL is ok.
cs: Pokud níže vidíš stream z Tvé web kamery, zadaná URL streamu je v pořádku.

source: Stream test
cs: Test streamu

source: Could not retrieve snapshot URL, please double check the URL
cs: Nepodařilo se získat URL snímku, prosím znovu zkontroluj URL pro snímky

source: Snapshot test failed
cs: Test snímků selhal

source: Could retrieve the snapshot URL, but it didn't look like an image. Got this as a content type header: <code>%(content_type)s</code>. Please double check that the URL is returning static images, not multipart data or videos.
cs: Je možné načíst URL adresu snímku, ale ten nevypadá jako obrázek. Byl zjištěn následující typ hlavičky souboru:<code>%(content_type)s</code>. Prosím zkontrolujte, zda URL adresa vrací statické obrázky a ne vícesložková data nebo videa.

source: If you see your webcam snapshot picture below, the entered snapshot URL is ok.
cs: Pokud níže vidíš snímek z Tvé web kamery, zadaná URL pro snímky je v pořádku.

source: Snapshot test
cs: Test snímání obrázků

source: The path doesn't exist
cs: Cesta neexistuje

source: The path is not a file
cs: Cesta není soubor

source: The path is not an executable
cs: Cesta není spustitelná

source: The path is valid
cs: Cesta je platná

source: The server is not reachable
cs: Server není dostupný

source: The server is reachable
cs: Server je dostupný

source: The path is a broken symlink.
cs: Cesta je poškozeným symbolickým odkazem.

source: The path does not exist and cannot be created.
cs: Cesta neexistuje a nemůže být vytvořena

source: The path is not a folder.
cs: Cesta není adresář.

source: The path is not writable.
cs: Do cesty není možné zapisovat

source: This will generate a new API Key. The old API Key will cease to function immediately.
cs: Toto vytvoří nový klíč API. Starý klíč API přestane fungovat okamžitě.

source: Do nothing
cs: Nic nedělat

source: Select for printing
cs: Zvolit pro tisk

source: Start printing
cs: Spustit tisk

source: Slicing %(filename)s
cs: Rozřezávám %(filename)s

source: Cannot slice on the same device while printing
cs: Není možné slicovat na stejném zařízení dokud se tiskne

source: Cannot slice, not all parameters specified
cs: Není možné začít slicovat, protože nebyly nastaveny všechny parametry

source: Start the slicing process
cs: Spustit proces slicování

source: The command "%(command)s" was triggered asynchronously
cs: Příkaz "%(command)s" byl sepnut asynchronně

source: The command "%(command)s" executed successfully
cs: Příkaz "%(command)s" proveden úspěšně

source: The command "%(command)s" could not be executed.
cs: Příkaz "%(command)s" nemohl být proveden.

source: Error
cs: Chyba

source: Changing Offset of %(name)s
cs: Měněn Offset %(name)s

source: Use the form below to specify a new offset to apply to all temperature commands sent from printed files for "%(name)s"
cs: Použijte formulář níže pro nastavení nového offsetu platného pro všechny příkazy na teplotu odeslané z tisknutého souboru pro "%(name)s"

source: Bed
cs: Podložka

source: Chamber
cs: Komora

source: Set %(name)s (%(value)s)
cs: Nastav %(name)s(%(value)s)

source: Off
cs: Vypnuto

source: Actual
cs: Aktuální

source: Target
cs: Cíl

source: showing %(displayed)d lines (%(filtered)d of %(total)d total lines filtered, buffer full)
cs: zobrazuji %(displayed)d řádků (%(filtered)d z %(total)d celkem, vyrovnávací paměť je plná)

source: showing %(displayed)d lines (%(filtered)d of %(total)d total lines filtered)
cs: zobrazuji %(displayed)d řádků (%(filtered)d z %(total)d celkem)

source: showing %(displayed)d lines (buffer full)
cs: zobrazuji %(displayed)d řádků (vyrovnávací paměť je plná)

source: showing %(displayed)d lines
cs: zobrazuji %(displayed)d řádků

source: Failed to remove timelapse %(name)s.</p><p>Please consult octoprint.log for details.</p>
cs: Selhalo mazání souboru s časosběrem %(name)s. </p><p> Prosím zkontrolujte octoprint.log pro podrobnosti.</p>

source: Could not remove timelapse
cs: Časosběr nemohl být smazán

source: You are about to delete timelapse file "%(name)s".
cs: Opravdu chceš smazat časosběrný soubor "%(name)s".

source: You are about to delete %(count)d timelapse files.
cs: Opravdu chceš smazat %(count)d časosběrných souborů.

source: You are about to delete unrendered timelapse "%(name)s".
cs: Opravdu chceš smazat nevytvořený časosběrný soubor "%(name)s".

source: You are about to delete %(count)d unrendered timelapses.
cs: Opravdu chceš smazat %(count)d nevytvořených časosběrných souborů.

source: Deleting timelapse files
cs: Mažu časosběrné soubory

source: Deleting %(count)d timelapse files...
cs: Mažu %(count)d časosběrných souborů...

source: Deleting unrendered timelapses
cs: Mazání nevytvořených časosběrů

source: Deleting %(count)d unrendered timelapses...
cs: Mazání %(count)d nevytvořených časosběrů

source: Capturing timelapse postroll
cs: Ukončování záznamu časosběru

source: Now capturing timelapse post roll, this will take only a moment...
cs: Nyní se ukončuje záznam časosběru, už to potrvá jen chvilku

source: Now capturing timelapse post roll, this will take approximately %(duration)s (so until %(time)s)...
cs: Nyní se ukončuje záznam časosběru, potrvá to zhruba %(duration)s (tedy do %(time)s)...

source: Now capturing timelapse post roll, this will take approximately %(duration)s...
cs: Nyní se ukončuje záznam časosběru, potrvá to zhruba %(duration)s...

source: Failed repeatedly to capture timelapse frame from webcam - is the snapshot URL configured correctly and the camera on?
cs: Opakovaně se nepovedlo získat snímky z web kamery - je URL adresa pro snímky nastavena správně a kamera zapnuta?

source: Could not capture snapshots
cs: Není možné získat snímek

source: Rendering timelapse
cs: Vytvářím časosběr

source: Now rendering timelapse %(movie_prefix)s. Due to performance reasons it is not recommended to start a print job while a movie is still rendering.
cs: Právě se zpracovávají časosběry %(movie_prefix)s. Z důvodu omezeného výkonu se nedoporučuje pouštět novou tiskovou úlohu, dokud se nedokončí toto časosběrné video.

source: Cannot render timelapse
cs: Není možné vytvořit časosběr

source: Rendering of timelapse %(movie_prefix)s is not possible since no frames were captured. Is the snapshot URL configured correctly?
cs: Vytvoření časosběru %(movie_prefix)s nebylo možné, protože nebyly získány žádné snímky. Je URL adresa pro snímky nastavena správně?

source: Rendering timelapse failed
cs: Vytvoření časosběru selhalo

source: Rendering of timelapse %(movie_prefix)s failed with return code %(returncode)s
cs: Vytváření časosběru %(movie_prefix)s selhalo s kódem chyby %(returncode)s

source: Rendering of timelapse %(movie_prefix)s failed due to an unknown error, please consult the log file
cs: Vytváření časosběru %(movie_prefix)s skončilo neznámou chybou, zkontroluj prosím soubor s logem pro podrobnosti

source: Timelapse ready
cs: Časosběr je hotov

source: New timelapse %(movie_prefix)s is done rendering.
cs: Nový časosběr %(movie_prefix)s byl vytvořen.

source: Not possible
cs: Nemožné

source: You may not delete your own account.
cs: Není možné vymazat tvůj vlastní účet.

source: Site default
cs: Základní nastavení

source: This will delete the API Key. It will cease to to function immediately.
cs: Toto smaže klíč API. Ten přestane fungovat okamžitě.

source: Create Folder
cs: Vytvořit adresář

source: Please specify the name of the folder to create.
cs: Prosím zadej jméno vytvářeného adresáře.

source: Folder name
cs: Název adresáře

source: Create
cs: Vytvořit

source: Slicing is currently disabled since no slicer has been configured yet. Please configure a slicer under "Settings".
cs: Slicování je vypnuto, protože není nastaveno. Prosím nastavte jej v "Nastavení".

source: Please configure which slicer and which slicing profile to use and name the GCode file to slice to below, or click "Cancel" if you do not wish to slice the file now.
cs: Nastavte slicer a jeho profil, který se má použít pro rozřezání a jméno souboru s GCode nebo klikněte na "Zrušit" pokud nechcete slicování provést teď.

source: Select a slicer...
cs: Zvol slicer...

source: Runs locally
cs: Spustit místně

source: For performance reasons locally run slicers are disabled while printing
cs: Z výkonnostních důvodů je místně běžící slicování vypnuto dokud se tiskne

source: Slicing Profile
cs: Profil sliceru

source: Select a slicing profile...
cs: Zvol profil sliceru...

source: Printer Profile
cs: Profil tiskárny

source: Select a printer profile...
cs: Vyber profil tiskárny...

source: Output Filename
cs: Výstupní název souboru

source: After slicing...
cs: Po rozřezání...

source: Slice
cs: Rozřež

source: Current Offset
cs: Aktuální Offset

source: New Offset
cs: Nový Offset

source: Delete Offset
cs: Smazat Offset

source: Hint: Hitting <kbd>Enter</kbd> in the input field will also submit the form
cs: Tip: Stisknutím tlačítka <kbd>Enter</kbd> v zadávacím poli bude formulář také odeslán

source: Setup Wizard
cs: Průvodce nastavením

source: <strong>Mandatory Step!</strong> You need to fill this out now.
cs: <strong>Povinný krok!</strong> Je nutné toto vyplnit nyní.

source: Next
cs: Další

source: Previous
cs: Předcházející

source: Unless otherwise noted, you may just skip any wizard page by clicking "Next" or "Finish".
cs: Pokud není uvedeno jinak, je možné přeskočit libovolnou stránku průvodce po kliknutí na "Další" nebo "Konec"

source: The snappy web interface for your 3D printer
cs: Elegantní webové rozhraní pro tvoji 3D tiskárnu

source: Active
cs: Aktivní

source: Update User
cs: Aktualizovat uživatele

source: Change password
cs: Změnit heslo

source: Delete user
cs: Smazat uživatele

source: Add user
cs: Přidat uživatele

source: Repeat Password
cs: Opakovat heslo

source: Abort
cs: Zrušit

source: Confirm
cs: Potvrdit

source: Edit user "%(user)s"
cs: Upravit uživatele "%(user)s"

source: Change password for user "%(user)s"
cs: Změnit heslo pro uživatele "%(user)s"

source: New Password
cs: Nové heslo

source: Current API Key
cs: Současný API klíč

source: N/A
cs: nedostupné

source: Allow <a href="%(url)s">Cross Origin Resource Sharing (CORS)</a>
cs: Povolit <a href="%(url)s">Cross Origin Resource Sharing (CORS)</a>

source: Needs restart
cs: Je třeba restart

source: Please note that changes to the API key are applied immediately, without having to "Save" first.
cs: Vezměte prosím na vědomí, že změny klíče API se použijí okamžitě, aniž byste museli nejprve stisknout "Uložit".

source: QR Code
cs: QR kód

source: Name of this OctoPrint instance, will be shown in the navigation bar and broadcast on the network
cs: Jméno této instance OctoPrintu bude zobrazeno nahoře v menu a sdíleno po síti.

source: Title
cs: Název

source: Personalize the color of the navigation bar - maybe to match your printer?
cs: Zvolte si barvu - možná podle barvy tiskárny?

source: Color
cs: Barva

source: For acrylic printers ;)
cs: Pro tiskárny z plexiskla :)

source: Transparent color
cs: Průhledná barva

source: Also personalize the icon of the browser tab
cs: Také přizpůsobí ikony v záložce prohlížeče

source: Colorize favicon (in supported browsers)
cs: Zbarvení favicon (v podporovaných prohlížečích)

source: Language Packs
cs: Jazykové balíčky

source: Manage...
cs: Spravovat...

source: Default Language
cs: Výchozí jazyk

source: Changes to the default interface language will only become active after a reload of the page and only be active if not overridden by the users language settings.
cs: Změny v nastavení jazyka pro uživatelské rozhraní se stanou aktivní po znovu načtení stránky. Aktivními se stanou pouze v případě, že uživatelské nastavení není jiné.

source: Show temperatures in Fahrenheit as well as Celsius
cs: Ukázat teplotu ve stupních Celsia i Fahrenheita

source: Show fuzzy print time estimates
cs: Zobraz nepřesný odhad doby tisku

source: Manage Language Packs...
cs: Spravuj jazykové balíčky

source: There is currently no central repository for language packs like there is for plugins - any help to change that is appreciated!
cs: V současné době neexistuje centrální repozitář pro jazykové balíčky doplňků - jakákoliv pomoc je vítána!

source: Until a repository is available, please see <a href="%(url)s" target="_blank" >the wiki</a> for language packs provided by the community.
cs: Dokud nebude k dispozici repozitář, podívejte se prosím na stránky <a href="%(url)s" target="_blank"> wiki </a> pro jazykové balíčky poskytované komunitou.

source: Available Language Packs
cs: Dostupné jazykové balíčky

source: Last update:
cs: Poslední aktualizace:

source: No additional Language Packs are installed at the moment.
cs: Žádné další jazykové balíčky nejsou nainstalované.

source: Upload additional Language Packs
cs: Nahrát další jazykové balíčky

source: Upload
cs: Nahrát

source: This does not look like a valid language pack. Valid language packs should be either zip files or tarballs and have the extension ".zip", ".tar.gz", ".tgz" or ".tar"
cs: Toto není povolená přípona pro jazykový balíček. Povolen přípony jsou ".zip", ".tar.gz", ".tgz" nebo ".tar"

source: Please note that you will have to reload the page in order for any newly added language packs to become available.
cs: Mějte na paměti, že po přidání každého jazykového balíčku je třeba obnovit stránku, aby byl balíček dostupný.

source: Enable Temperature Graph
cs: Povolit teplotní graf

source: Enable model size detection and warn if model exceeds print bed
cs: Povolit hlídání velikosti modelu a varování, pokud je model větší než tisková plocha

source: Confirm before cancelling a print
cs: Potvrzení před zrušením tisku

source: Enable SD support
cs: Povolit podporu SD

source: Enable Keyboard Control
cs: Povolit ovládání klávesnicí

source: <code>G90</code>/<code>G91</code> overrides relative extruder mode
cs: <code>G90</code>/<code>G91</code> přepíše relative extruder mode

source: This is used by the GCODE analysis in the backend and the viewer in the frontend to interpret your sliced files correctly.
cs: Toto je použito při analýze GCODE na pozadí a v GCODE prohlížeči pro správné zobrazení slicovaných souborů.

source: Commands to not completely auto uppercase in the terminal tab
cs: Příkazy automaticky nepřeváděné na velká písmena v záložce Terminál

source: Terminal Auto Uppercase Blacklist
cs: Černá listina pro automatický převod na velká písmena v Terminálu

source: Use this to specify the commands that should not have their parameters automatically uppercased in the terminal tab. Just the G or M code, comma separated.
cs: Pomocí tohoto určíte příkazy, které by neměly mít na kartě terminálu automaticky nastavené parametry. Pouze kód G nebo M, oddělený čárkou.

source: Upload Folder
cs: Složka pro Upload

source: Timelapse Folder
cs: Složka pro časosběry

source: Timelapse Temp Folder
cs: Dočasná složka pro časosběry

source: Logs Folder
cs: Složka pro logy

source: Watched Folder
cs: Sledovaná složka

source: Actively poll the watched folder. Check this if files in your watched folder aren't automatically added otherwise.
cs: Aktivně sledovaná složka. Toto zkontroluj, jestliže se soubory ve sledované složce automaticky nepřidávají.

source: Disk space thresholds
cs: Limity místa na disku

source: If the free disk space falls below these thresholds, OctoPrint will warn the user.
cs: Když volné místo dosáhne těchto limitů, uživatel je varován.

source: Warning
cs: Varování

source: Critical
cs: Kritická

source: Provide values including size unit. Allowed units are: b, byte, bytes, kb, mb, gb, tb (case insensitive). Example: <code>5MB</code>, <code>500KB</code>
cs: Zadejte velikost společně s jednotkami. Povolené jednotky jsou: b, byte, bytes, kb, mb, gb, tb (na velikosti písmen nezáleží). Příklad: <code>5MB</code>, <code>500KB</code>

source: Before print job starts
cs: Před spuštěním tisku

source: After print job completes
cs: Po skončení tisku

source: After print job is cancelled
cs: Po zrušení tisku

source: After print job is paused
cs: Při pozastavení tisku

source: Before print job is resumed
cs: Než je tisk obnoven

source: Before tool change
cs: Před změnou nástroje

source: After tool change
cs: Po změně nástroje

source: After connection to printer is established
cs: Poté co je navázáno spojení s tiskárnou

source: Before connection to printer is closed
cs: Před odpojením od tiskárny

source: This will only be executed when closing the connection actively. If the connection to the printer is suddenly lost nothing will be sent.
cs: Toto se provede pouze při řízeném ukončování spojení. Pokud se spojení s tiskárnou přeruší náhle, není odesláno nic.

source: Enable GCode Visualizer
cs: Povolit Gcode náhled

source: Maximum size the GCodeViewer autoloads the file for preview
cs: Maximální velikost pro automatické načtení GCode náhledu

source: GCode Visualizer file size threshold
cs: Hranice velikosti pro GCode náhled

source: on desktop
cs: na stolním PC

source: on mobile
cs: na mobilu

source: Add Profile...
cs: Přidat profil...

source: Intervals &amp; timeouts
cs: Intervaly &amp; timeouty

source: Firmware &amp; protocol
cs: Firmware &amp; protokol

source: Behaviour
cs: Chování

source: Serial port to connect to, setting this to AUTO will make OctoPrint try to automatically find the right setting
cs: Sériový port kde je připojena tiskárna, volba AUTO umožní OctoPrintu pokusit se nalézt správný port automaticky

source: Serial Port
cs: Sériový port

source: Serial baud rate to connect with, setting this to AUTO will make OctoPrint try to automatically find the right setting
cs: Rychlost přenosu, při volbě AUTO se OctoPrint pokusí nalézt rychlost automaticky.

source: Baudrate
cs: Rychlost (baud)

source: Makes OctoPrint try to connect to the printer automatically during start up
cs: OctoPrint se pokusí po startu automaticky připojit k tiskárně.
