Repository: wojtas26/octoprint
Catalog: messages.po
Languages: cs

source: Update successful, restart required!
cs: Aktualizace byla úspěšná a je vyžadován restart!

source: Restarting OctoPrint failed, please restart it manually. You might also want to consult octoprint.log on what went wrong here.
cs: Restart OctoPrintu selhal, prosím restartujte jej ručně. Můžete zkontrolovat octoprint.log co se stalo.

source: Rebooting the server failed, please reboot it manually. You might also want to consult octoprint.log on what went wrong here.
cs: Restart serveru selhal, prosím restartujte jej ručně. Můžete zkontrolovat octoprint.log co se stalo.

source: Update successful!
cs: Aktualizace úspěšná!

source: The update finished successfully.
cs: Aktualizace proběhla úspěšně.

source: Update failed!
cs: Aktualizace se nezdařila!

source: The update did not finish successfully. Please consult <code>octoprint.log</code> and <code>plugin_softwareupdate_console.log</code> for details.
cs: Aktualizace nebyla úspěšná. Prosím zkontrolujte <code>octoprint.log</code> a <code>plugin_softwareupdate_console.log</code> pro více podrobností.

source: Please configure the <strong>checkout folder</strong> of OctoPrint, otherwise this plugin won't be able to update it. Click on the <i class="fa fa-wrench"></i> button to do this. Also refer to the <a href="https://github.com/foosel/OctoPrint/wiki/Plugin:-Software-Update" target="_blank">Documentation</a>.
cs: Prosím nastavte <strong> kontrolní adresář </strong> Octoprintu, jinak doplněk nebude moci být aktualizován. Kliknutí na <i class="fa fa-wrench"></i> tlačítko toto provede. Rovněž je možné nahlédnout do <a href="https://github.com/foosel/OctoPrint/wiki/Plugin:-Software-Update" target="_blank"> Dokumentace </a>.

source: <p> <strong>You are running a non-release version of OctoPrint but are tracking OctoPrint releases.</strong> </p><p> You probably want OctoPrint to track the matching development version instead. If you have a local OctoPrint checkout folder switched to another branch, <strong>simply switching over to "Commit" tracking</strong> will already take care of that. Otherwise please take a look at the <a href="https://github.com/foosel/OctoPrint/wiki/Plugin:-Software-Update" target="_blank">Documentation</a>. </p>
cs: <p> <strong>Provozuješ neoficiální verzi OctoPrintu, ale sleduješ oficiální verzi OctoPrintu.</strong> </p><p> Pravděpodobně chceš, aby OctoPrint místo toho následoval správnou vývojovou verzi. Pokud máš místní OctoPrint kontrolní adresář přepnutý do jiné vývojové verze, <strong>Jednoduché přepnutí na "Commit" sledování</strong> to zařídí. Jinak se prosím podívej na <a href="https://github.com/foosel/OctoPrint/wiki/Plugin:-Software-Update" target="_blank">Dokumentaci</a>. </p>

source: <p> <strong>This version of the Python environment is not supported for direct updates.</strong> </p> <p> To reduce the likelihood of running into update problems in outdated environments, the following minimal versions are required to use this updater to update OctoPrint or any installed plugins: </p>
cs: <p> <strong>Tato verze prostředí Python není podporována přímou aktualizací.</strong> </p> <p> Chcete-li snížit pravděpodobnost aktualizačních problémů v zastaralém prostředí, zajistěte tuto minimální verzi kterou je nutné používat aby bylo možné provádět aktualizaci OctoPrintu nebo nainstalovaných doplňků: </p>

source: you have
cs: máte

source: <p> Please take a look at <a href="https://faq.octoprint.org/unsupported-python-environment" target="_blank">this FAQ entry on how to proceed</a>. </p>
cs: <p> Prosím podívejte se na <a href="https://faq.octoprint.org/unsupported-python-environment" target="_blank">tuto nápovědu ve FAQ</a>. </p>

source: Current versions
cs: Současné verze

source: Update available
cs: Dostupná aktualizace

source: Update
cs: Aktualizovat

source: Installed:
cs: Nainstalováno:

source: Available:
cs: Dostupné:

source: Release Notes:
cs: Poznámky k verzi:

source: Update all
cs: Aktualizovat vše

source: Check for update now
cs: Zkontrolovat aktualizace nyní

source: Last cache refresh:
cs: Poslední obnovení cache:

source: Force check for update (overrides cache used for update checks)
cs: Vynutit kontrolu aktualizace

source: Force update now (even if no new versions are available)
cs: Vynutit aktualizaci (i když není nová verze)

source: Version cache TTL
cs: Délka vyrovnávací paměti pro verze

source: Show update notifications to users
cs: Ukázat upozornění o aktualizaci uživatelům

source: If you uncheck this, only logged in admins will see update notifications. Update notifications shown to users do not include the "Update now" button.
cs: Pokud tuto možnost zrušíte, zobrazí se oznámení o aktualizacích pouze přihlášeným administrátorům. Aktualizace upozornění zobrazená uživatelům nezahrnují tlačítko "Aktualizovat nyní".

source: Update in progress, please wait.
cs: Probíhá aktualizace, prosím počkejte.

source: Update done, please close this window.
cs: Aktualizace dokončena, zavřete prosím dialogové okno

source: <p> By default, OctoPrint will update itself via <code>pip</code> to published releases. OctoPrint can also update itself via <code>git</code> to arbitrary development branches you need to check out manually. If you want to do that though it needs to know its checkout folder. You can configure that here. </p>
cs: <p> Ve výchozím stavu se OctoPrint aktualizuje sám pomocí <code>pip</code> do vydané verze. OctoPrint se může rovněž aktualizovat sám pomocí <code>git</code> do libovolné vývojové verze kterou zadáte ručně. Pokud toto chcete takto udělat, je nutné znát kontrolní adresář. Ten můžete nastavit zde. </p>

source: <p> If you are running a release version of OctoPrint, leave at "Release" tracking. If you are running a different branch however, you should setup "Commit" tracking. </p>
cs: <p> Pokud provozuješ vydanou verzi OctoPrintu, ponech nastavené "Release" sledování. Pokud provozuješ jinou verzi, ponech nastavené "Commit" sledování. </p>

source: OctoPrint checkout folder
cs: OctoPrint kontrolní adresář

source: This needs to be set if you select commit based version tracking.
cs: Toto je třeba nastavit pokud zvolíte sledování na základě commitu.

source: OctoPrint Release Channel
cs: Kanál s vydáním Octoprintu

source: Make sure you have read <a href="%(url)s" target="_blank" rel="noreferrer noopener">"How to use the release channels to help test release candidates"</a> before switching to a release channel other than "Stable"
cs: Ujistěte se, že jste četli <a href="%(url)s" target="_blank" rel="noreferrer noopener">"How to use the release channels to help test release candidates"</a> před přepnutím na jiný kanál s vydáním než "Stable"

source: OctoPrint version tracking
cs: Sledování verzí OctoPrintu

source: Anonymous Usage Tracking
cs: Anonymní sledování užívání

source: Please set up anonymous usage tracking
cs: Prosím nastavte Anonymní sledování užívání

source: You haven't yet decided on whether to enable or disable anonymous usage tracking. You need to either enable or disable it before continuing.
cs: Ještě nemáte nastavené Anonymní sledování užívání. Je třeba je povolit nebo zakázat před dalším pokračováním.

source: Please open a <a href='%(bugreport)s' target='_blank' rel='noopener noreferrer'>bug report</a> on this. Make sure to include all requested information, including your <a href='%(jsconsole)s' target='_blank' rel='noopener noreferrer'>JS console</a> and <code>octoprint.log</code>.
cs: Prosím založte o tomto <a href='%(bugreport)s' target='_blank' rel='noopener noreferrer'>chybové hlášení</a>. Ujistěte se, že jste vložili všechny požadované informace včetně vaší <a href='%(jsconsole)s' target='_blank' rel='noopener noreferrer'>JS konzole</a> a <code>octoprint.log</code>.

source: Enable anonymous usage tracking
cs: Povolit Anonymní sledování užívání

source: Events to track. The ping is mandatory.
cs: Události ke sledování. Ping je povinný.

source: Tracked events
cs: Sledované události

source: Regular ping
cs: Pravidelný ping

source: Server startup & shutdown
cs: Start & vypnutí serveru

source: Connected to printer
cs: Připojeno k tiskárně

source: Printer Safety Check warnings
cs: Bezpečnostní kontrola tiskárny - varování

source: Print started/cancelled/finished
cs: Tisk začal/byl zrušen/skončil

source: Errors in the communication with the printer and/or reported by the firmware
cs: Chyby v komunikaci s tiskárnou a/nebo nahlášené firmwarem

source: Plugin installed/uninstalled/enabled/disabled
cs: Doplněk byl nainstalován/odinstalován/povolen/zakázán

source: OctoPrint or a plugin updated successfully or unsuccessfully
cs: OctoPrint nebo doplněk byl aktualizován úspěšně nebo neúspěšně

source: System got throttled/unthrottled (currently only detected on RPis)
cs: System byl omezen/uvolněn (nyní zjišťováno pouze na RPi)

source: Configure Anonymous Usage Tracking
cs: Nastavení Anonymní sledování užívání

source: <strong>Note:</strong> You can always change your decision and also access more granular controls via Settings > Anonymous Usage Tracking.
cs: <strong>Poznámka:</strong> Vždy můžete změnit Vaše rozhodnutí a také přístup více kontrolovat pomocí Nastavení > Anonymní sledování užívání.

source: Disable Anonymous Usage Tracking
cs: Zakázat Anonymní sledování užívání

source: Enable Anonymous Usage Tracking
cs: Povolit Anonymní sledování užívání

source: Anonymous Usage Tracking is <strong class="text-success">enabled</strong>.
cs: Anonymní sledování užívání je <strong class="text-success">povoleno</strong>.

source: Anonymous Usage Tracking is <strong class="text-danger">disabled</strong>.
cs: Anonymní sledování užívání je <strong class="text-danger">zakázáno</strong>.

source: <p> Anonymous usage tracking provides valuable insights into how many instances running what versions of OctoPrint are out there, whether they are successfully completing print jobs and various other metrics. </p> <p> By enabling it you help to identify problems with new releases and release candidates early on, and to better tailor OctoPrint's future development to actual use. </p>
cs: <p> Anonymní sledování používání získává informace o tom, kolik instancí a jaké verze OctoPrintu používáte, jak úspěšně dokončily tisk a některé další informace. </p> <p> Jeho povolením pomůžete identifikovat problém s novou verzí a její předverzí dříve a lépe přizpůsobit budoucí vývoj OctoPrintu současnému užití. </p>

source: For details on what gets tracked, please refer to <a href="https://tracking.octoprint.org" target="_blank" rel="noopener noreferrer">tracking.octoprint.org</a> and also the <a href="https://tracking.octoprint.org/privacy" target="_blank" rel="noopener noreferrer">Privacy Policy at tracking.octoprint.org</a>.
cs: Pro detaily co je sledováno, prosím nahlédněte do <a href="https://tracking.octoprint.org" target="_blank" rel="noopener noreferrer">tracking.octoprint.org</a> a také zde <a href="https://tracking.octoprint.org/privacy" target="_blank" rel="noopener noreferrer">Zásady ochrany osobních údajů na tracking.octoprint.org</a>.

source: Plugins
cs: Doplňky - Pluginy

source: Connection
cs: Připojení

source: State
cs: Stav

source: Files
cs: Soubory

source: Temperature
cs: Teplota

source: Control
cs: Ovládání

source: GCode Viewer
cs: Gcode prohlížeč

source: Terminal
cs: Terminál

source: Timelapse
cs: Časosběr

source: Printer
cs: Tiskárna

source: Serial Connection
cs: Sériové připojení

source: Printer Profiles
cs: Profily tiskárny

source: Temperatures
cs: Teploty

source: Terminal Filters
cs: Filtry terminálu

source: GCODE Scripts
cs: GCODE skripty

source: Features
cs: Funkce

source: GCODE Visualizer
cs: GCODE prohlížeč

source: Folders
cs: Složky

source: Appearance
cs: Vzhled

source: Access
cs: Přístup

source: Interface
cs: Rozhraní

source: Finish
cs: Konec

source: Shutdown system
cs: Vypnout systém

source: <strong>You are about to shutdown the system.</strong></p><p>This action may disrupt any ongoing print jobs (depending on your printer's controller and general setup that might also apply to prints run directly from your printer's internal storage).
cs: <strong>Chcete vypnout systém.</strong></p><p>Toto může přerušit probíhající tiskové úlohy (v závislosti na řízení Vaší tiskárny a hlavním nastavení kde je možno zvolit tisk přímo z vnitřní paměti tiskárny).

source: Reboot system
cs: Restart systému

source: <strong>You are about to reboot the system.</strong></p><p>This action may disrupt any ongoing print jobs (depending on your printer's controller and general setup that might also apply to prints run directly from your printer's internal storage).
cs: <strong>Chcete restartovat systém.</strong></p><p>Toto může přerušit probíhající tiskové úlohy (v závislosti na řízení Vaší tiskárny a hlavním nastavení kde je možno zvolit tisk přímo z vnitřní paměti tiskárny).

source: Restart OctoPrint
cs: Restartovat OctoPrint

source: <strong>You are about to restart the OctoPrint server.</strong></p><p>This action may disrupt any ongoing print jobs (depending on your printer's controller and general setup that might also apply to prints run directly from your printer's internal storage).
cs: <strong>Chcete restartovat server OctoPrint.</strong></p><p>Toto může přerušit probíhající tiskové úlohy (v závislosti na řízení Vaší tiskárny a hlavním nastavení kde je možno zvolit tisk přímo z vnitřní paměti tiskárny).

source: Restart OctoPrint in safe mode
cs: Restartovat OctoPrint do bezpečného modu

source: <strong>You are about to restart the OctoPrint server in safe mode.</strong></p><p>This action may disrupt any ongoing print jobs (depending on your printer's controller and general setup that might also apply to prints run directly from your printer's internal storage).
cs: <strong>Chcete restartovat OctoPrint do bezpečného modu.</strong></p><p>Toto může přerušit probíhající tiskové úlohy (v závislosti na řízení Vaší tiskárny a hlavním nastavení kde je možno zvolit tisk přímo z vnitřní paměti tiskárny).

source: Server is offline
cs: Server je vypnutý

source: The server appears to be offline, at least I'm not getting any response from it. I'll try to reconnect automatically <strong>over the next couple of minutes</strong>, however you are welcome to try a manual reconnect anytime using the button below.
cs: Vypadá to, že je server vypnutý, nedostávám od něj žádnou odpověď. Budu se snažit připojit automaticky <strong> následujících pár minut</strong>, nicméně můžete zkusit manuální znovu připojení pomocí tlačítka níže.

source: The server appears to be offline, at least I'm not getting any response from it. I <strong>could not reconnect automatically</strong>, but you may try a manual reconnect using the button below.
cs: Vypadá to že je server vypnutý, nedostávám od něj žádnou odpověď.<strong> Nemohl jsem se připojit automaticky</strong>, nicméně můžete zkusit manuální znovu připojení pomocí tlačítka níže.

source: Unknown
cs: Neznámé

source: Command line flag
cs: Příznak příkazové řádky

source: Setting in config.yaml
cs: Nastavení v config.yaml

source: Problem during last startup
cs: Problém během posledního spouštění

source: Safe mode is active
cs: Bezpečný mod je zapnut

source: <p>The server is currently running in safe mode. Third party plugins are disabled and cannot be enabled.</p><p>Reason: %(reason)s</p>
cs: <p>Server nyní běží v bezpečném modu. Doplňky třetích stran jsou vypnuté a nemohou být povoleny.</p><p>Důvod: %(reason)s</p>

source: Slicing ... (%(percentage)d%%)
cs: Slicování ... (%(percentage)d%%)

source: Error reported by printer
cs: Chyba nahlášená tiskárnou

source: Your printer's firmware reported an error. Due to that the ongoing print job will be cancelled. Reported error: %(firmwareError)s
cs: Firmware Vaší tiskárny nahlásil chybu. Z tohoto důvodu byla probíhající tisková úloha zrušena. Nahlášená chyba: %(firmwareError)s

source: Your printer's firmware reported an error. Due to that OctoPrint will disconnect. Reported error: %(error)s
cs: Firmware Vaší tiskárny nahlásil chybu. Z tohoto důvodu byl OctoPrint odpojen. Nahlášená chyba: %(error)s

source: Communication error
cs: Chyba komunikace

source: There was a communication error while talking to your printer. Please consult the terminal output and octoprint.log for details. Error: %(error)s
cs: Při komunikaci s tiskárnou došlo k chybě. Zkontrolujte prosím terminálový výstup a octoprint.log pro více podrobností. Chyba: %(error)s

source: Error connecting to printer
cs: Chyba při připojování k tiskárně

source: There was an error while trying to connect to your printer. Error: %(error)s
cs: Nastala chyba při připojování k Vaší tiskárně. Chyba: %(error)s

source: Error starting a print
cs: Chyba při spouštění tisku

source: There was an error while trying to start a print job. Error: %(error)s
cs: Nastala chyba při spouštění tiskové úlohy. Chyba: %(error)s

source: Unknown error
cs: Neznámá chyba

source: There was an unknown error while talking to your printer. Please consult the terminal output and octoprint.log for details. Error: %(error)s
cs: Při komunikaci s tiskárnou nastala neznámá chyba. Prosím zkontrolujte terminálový výstup a octoprint.log pro více podrobností. Chyba: %(error)s

source: It looks like your printer reset while a connection was active. If this was intentional you may safely ignore this message. Otherwise you should investigate why your printer reset itself, since this will interrupt prints and also file transfers to your printer's SD.
cs: Vypadá to, že Vaše tiskárna byla resetována když byla připojena. Pokud to bylo úmyslné, můžete tuto zprávu ignorovat. Jinak by bylo dobré zjistit proč se tiskárna sama resetovala, protože toto může přerušit probíhající tisk nebo přenos souborů na SD kartu tiskárny.

source: It looks like your printer reset while a connection was active. Due to this the ongoing job was aborted. If this was intentional you may safely ignore this message. Otherwise you should investigate why your printer reset itself, since this will interrupt prints and also file transfers to your printer's SD.
cs: Zdá se, že tiskárna byla resetována, když bylo připojení aktivní. Z tohoto důvodu byla probíhající práce přerušena. Pokud to bylo úmyslné, můžete tuto zprávu bezpečně ignorovat. V opačném případě byste měli zjistit, proč se tiskárna resetuje sama, protože to přeruší tisk a také přenos souborů do SD karty Vaší tiskárny.

source: Printer reset detected
cs: Detekován reset tiskárny

source: %(days)d day
cs: %(days)d den

source: %(days)d days
cs: %(days)d dnů

source: %(days)d.5 days
cs: %(days)d.5 dnů

source: %(hours)d hour
cs: %(hours)d hodina

source: %(hours)d hours
cs: %(hours)d hodin

source: %(hours)d.5 hours
cs: %(hours)d.5 hodin

source: 1 day
cs: 1 den

source: a minute
cs: minuta

source: 2 minutes
cs: 2 minuty

source: %(minutes)d minutes
cs: %(minutes)d minut

source: 40 minutes
cs: 40 minut

source: 50 minutes
cs: 50 minut

source: 1 hour
cs: 1 hodina

source: a few seconds
cs: pár sekund

source: less than a minute
cs: méně jak minuta

source: YYYY-MM-DD HH:mm
cs: DD.MM.YYYY HH:mm

source: off
cs: Vypnuto

source: Are you sure?
cs: Jsi si jistý?

source: Progress
cs: Postup

source: Offline
cs: Vypnuto

source: Opening serial port
cs: Otevírání sériového portu

source: Detecting serial port
cs: Detekování sériového portu

source: Detecting baudrate
cs: Detekování rychlosti

source: Connecting
cs: Připojování

source: Operational
cs: Připraveno

source: Starting
cs: Startuji

source: Starting print from SD
cs: Startuji tisk z SD karty

source: Printing from SD
cs: Tisk z SD

source: Sending file to SD
cs: Odesílání souboru do SD

source: Printing
cs: Tiskne

source: Paused
cs: Pauza

source: Closed
cs: Zavřeno

source: Transferring file to SD
cs: Přenos souboru na kartu SD

source: Pausing
cs: Pozastaveno

source: Resuming
cs: Obnovuji

source: Cancelling
cs: Rušení

source: Finishing
cs: Dokončuji

source: Connect
cs: Připojit

source: Disconnect
cs: Odpojit

source: <p><strong>You are about to disconnect from the printer while a print is in progress.</strong></p><p>Disconnecting while a print is in progress will prevent OctoPrint from completing the print. If you're printing from an SD card attached directly to the printer, any attempt to restart OctoPrint or reconnect to the printer could interrupt the print.<p>
cs: <p><strong>Opravdu chcete odpojit tiskárnu když probíhá tisk?</strong></p><p>Odpojenín tiskárny při tisku způsobí nedokončení tisku. Pokud tisknete přímo z SD karty tiskárny, může pokus o restart Octoprintu nebo o znovupřipojení tiskárny způsobit přerušení tisku.<p>

source: Are you sure you want to disconnect from the printer?
cs: Opravdu se chceš odpojit od tiskárny?

source: Stay Connected
cs: Zůstat připojen

source: Tool
cs: Nástroj

source: Hotend
cs: Tryska

source: Your available free disk space is critically low.
cs: Zbývá kriticky málo místa na disku.

source: Your available free disk space is starting to run low.
cs: Ubývá místa na disku.

source: Your current disk usage.
cs: Aktuální využití místa na disku.

source: Only show model files
cs: Zobrazit pouze soubory s modely

source: Only show machine code files
cs: Zobrazit pouze soubory se strojovým kódem

source: Only show %(type)s files
cs: Zobrazuji pouze %(type)s soubory

source: You are about to delete the folder "%(folder)s" which still contains files and/or sub folders.
cs: Opravdu chceš vymazat adresář "%(folder)s" který stále obsahuje soubory a/nebo podadresáře?

source: Model size
cs: Velikost modelu

source: Filament
cs: Struna

source: Estimated print time
cs: Odhadované trvání tisku

source: Last printed
cs: Naposledy vytisknuto

source: Last print time
cs: Naposledy tisk trval

source: Object in %(name)s exceeds the print volume of the currently selected printer profile, be careful when printing this.
cs: Objekt %(name)s přesahuje tiskový prostor aktuálně zvolené tiskárny, buď opatrný při jeho tisku.

source: Object exceeds print volume in width.<br>
cs: Objekt je větší než šířka tiskového prostoru.<br>

source: Object exceeds print volume in depth.<br>
cs: Objekt je větší než hloubka tiskového prostoru.<br>

source: Object exceeds print volume in height.<br>
cs: Objekt je větší než výška tiskového prostoru.<br>

source: Object's bounding box: (%(object.minX).2f, %(object.minY).2f, %(object.minZ).2f) &times; (%(object.maxX).2f, %(object.maxY).2f, %(object.maxZ).2f)
cs: Rozměry objektu: (%(object.minX).2f, %(object.minY).2f, %(object.minZ).2f) &times; (%(object.maxX).2f, %(object.maxY).2f, %(object.maxZ).2f)

source: Print volume: (%(profile.minX).2f, %(profile.minY).2f, %(profile.minZ).2f) &times; (%(profile.maxX).2f, %(profile.maxY).2f, %(profile.maxZ).2f)
cs: Tiskový prostor: (%(profile.minX).2f, %(profile.minY).2f, %(profile.minZ).2f) &times; (%(profile.maxX).2f, %(profile.maxY).2f, %(profile.maxZ).2f)

source: Object doesn't fit print volume
cs: Objekt se nevejde do tiskového prostoru

source: Slicing ...
cs: Rozřezávání

source: Slicing done
cs: Rozřezávání dokončeno

source: Sliced %(stl)s to %(gcode)s, took %(time).2f seconds
cs: Rozřezání %(stl)s souborů do %(gcode)s GCODE, zabralo %(time).2f sekund

source: Could not slice %(stl)s to %(gcode)s: %(reason)s
cs: Nelze rozřezat %(stl)s do %(gcode)s: %(reason)s

source: Slicing failed
cs: Rozřezání se nezdařilo

source: Streaming ...
cs: Streamování ...

source: Streaming done
cs: Streamování ukončeno

source: Streamed %(local)s to %(remote)s on SD, took %(time).2f seconds
cs: Odeslání %(local)s do %(remote)s na SD, zabralo %(time).2f sekund

source: Streaming failed
cs: Streamování selhalo

source: Did not finish streaming %(local)s to %(remote)s on SD
cs: Nebyl dokončen přenos z %(local)s do %(remote)sna SD
