Repository: wojtas26/octoprint
Catalog: messages.po
Languages: cs

source: Action Command Prompt
cs: Dialog na provedení Akce

source: Without this plugin your printer will no longer be able to triggerconfirmation or selection prompts in OctoPrint
cs: Bez tohoto doplňku nebude Vaše tiskárna již schopná zobrazit výběrový nebo potvrzovací dialog v Octoprintu.

source: Message from your printer
cs: Zpráva od Vaší tiskárny

source: Action Command Prompt Settings
cs: Nastavení dialogu na provedení Akce

source: Enable support
cs: Povolit podporu

source: If detected as supported by the firmware (<code>PROMPT_SUPPORT</code> capability)
cs: Pokud je detekován jako podporovaný firmwarem (<code>PROMPT_SUPPORT</code> funkce)

source: Always
cs: Vždy

source: Never
cs: Nikdy

source: Advanced options
cs: Pokročilé volby

source: Dialog command
cs: Příkazový dialog

source: Use this to define the dialog command. Default is <code>M876</code>. You normally should not have to change this.
cs: Použít toto pro nastavení dialogového příkazu. Výchozí hodnota je <code>M876</code>. Obvykle toto není třeba měnit.

source: Enable force sending of the configured command to bypass blocking firmware routines if detected as supported. You normally should not have to change this.
cs: Povolit nucené odeslání nastaveného příkazu pro obejití bloků ve firmwaru, pokud jsou detekované jako podporované. Obvykle toto není třeba měnit.

source: Enable signaling to the firmware that we support <code>prompt_*</code> actions if detected as supported. You normally should not have to change this.
cs: Povolit hlášení do firmwaru, který podporuje <code>prompt_*</code> akci, pokud je detekována jako podporovaná. Obvykle toto není třeba měnit.

source: Announcements
cs: Oznámení

source: Without this plugin you might miss important announcements regarding security or other critical issues concerning OctoPrint.
cs: Bez tohoto doplňku můžete zmeškat důležité bezpečnostní nebo jinak důležité oznámení OctoPrintu

source: Cannot be toggled
cs: Nelze přepnout

source: Disable Channel
cs: Zakázat kanál

source: Enable Channel
cs: Povolit kanál

source: You can edit your announcement subscriptions under Settings > Announcements.
cs: Můžete upravit své nastavení oznámení v menu Nastavení > Oznámení

source: Later
cs: Později

source: Mark read
cs: Označit přečtené

source: Read...
cs: Číst...

source: Mark as last read
cs: Označit jako poslední přečtené

source: Close
cs: Zavřít

source: Configured Channels
cs: Nastavené kanály

source: Name
cs: Jméno

source: Actions
cs: Akce

source: Refresh Announcements
cs: Obnovit oznámení

source: Application Keys
cs: Aplikační Klíč

source: Without this plugin third party clients will no longer be able to obtain an API key without you manually copy-pasting it.
cs: Bez tohoto doplňku nebudou již moci klienti třetích stran získat klíč API, aniž byste jej ručně kopírovali a vložili.

source: You are about to revoke the application key "%(key)s".
cs: Opravdu chcete zrušit aplikační klíč "%(key)s"?

source: "<strong>%(app)s</strong>" has requested access to control OctoPrint through the API.
cs: "<strong>%(app)s</strong>" požaduje přístup k ovládání OctoPrintu prostřednictvím API.

source: Do you want to allow access to this application with your user account?
cs: Chcete povolit přístup do této aplikace s Vaším uživatelským účtem?

source: Access Request
cs: Požadavek na přístup

source: Allow
cs: Povolit

source: Deny
cs: Zakázat

source: You are about to revoke %(count)d application keys.
cs: Opravdu chcete zrušit %(count)d aplikačních klíčů?

source: Revoking application keys
cs: Zrušit aplikační klíče

source: Revoking %(count)d application keys...
cs: Rušení %(count)d aplikačních klíčů

source: Revoked %(key)s...
cs: Zrušeno %(key)s ...

source: Revocation of %(key)s failed, continuing...
cs: Zrušení %(key)s selhalo, pokračuji ...

source: Deletion of %(key)s failed: %(error)s
cs: Smazání %(key)s selhalo: %(error)s

source: There are no application keys registered yet.
cs: Žádné klíče aplikací ještě nejsou zaregistrovány.

source: Select all on this page
cs: Vybrat vše na této stránce

source: Select all
cs: Označit vše

source: Select all by user...
cs: Vybrat vše uživatelem ...

source: Select all by app...
cs: Vybrat vše aplikací ...

source: Clear selection
cs: Zrušit výběr

source: Revoke selected
cs: Zrušit vybrané

source: User
cs: Uživatel

source: Application identifier
cs: Identifikátor aplikace

source: Action
cs: Akce

source: API Key
cs: API klíč

source: Copy API Key to clipboard
cs: Kopírování klíče API do schránky

source: Revoke
cs: Zrušit

source: Registered application keys
cs: Zaregistrované klíče aplikace

source: Manually generate an application key
cs: Ručně vygenerovat klíč aplikace

source: Generate
cs: Generovat

source: Backup & Restore
cs: Záloha & Obnovení

source: Without this plugin you will no longer be able to backup & restore your OctoPrint settings and data.
cs: Bez tohoto doplňku nebude dále možné provádět zálohu a obnovení Vašeho nastavení OctoPrintu a dalších dat.

source: You are about to delete backup file "%(name)s".
cs: Chcete smazat záložní soubor "%(name)s"?

source: You are about to restore the backup file "%(name)s". This cannot be undone.
cs: Chcete obnovit záložní soubor "%(name)s"? Toto nemůže být vráceno.

source: You are about to upload and restore the backup file "%(name)s". This cannot be undone.
cs: Chcete přesunout a obnovit záložní soubor "%(name)s". Toto nemůže být vráceno.

source: You are about to delete the record of plugins unknown during the last restore.
cs: Chcete smazat seznam neznámých doplňků z posledního obnovení?

source: You are about to delete %(count)d backups.
cs: Opravdu chcete smazat %(count)d záloh?

source: Backup created successfully
cs: Záloha úspěšně vytvořena

source: Creating the backup failed
cs: Vytvoření zálohy selhalo

source: OctoPrint could not create your backup. Please consult <code>octoprint.log</code> for details. Error: %(error)s
cs: OctoPrint nemohl vytvořit zálohu. Prosím zkontrolujte <code>octoprint.log</code> pro podrobnosti. Chyba: %(error)s

source: Restoring from backup...
cs: Obnovuji ze zálohy ...

source: Restore failed! Check the above output and octoprint.log for reasons as to why.
cs: Obnovení selhalo! Zkontrolujte výše uvedený záznam a octoprint.log pro zjištění příčiny.

source: Restore successful! The server will now be restarted!
cs: Obnovení úspěšné! Server bude nyní restartován!

source: Installing plugin "%(plugin)s}"...
cs: Instaluji doplněk "%(plugin)s}"...

source: Cannot install plugin "%(plugin)s" due to it being incompatible to this OctoPrint version and/or underlying operating system
cs: Nemohu nainstalovat doplněk "%(plugin)s" z důvodu nekompatibility s touto verzí OctoPrintu a/nebo operačního systému

source: There are %(count)d plugins you'll need to install manually since they aren't registered on the repository:
cs: Jsou zde %(count)d doplňky, které je nutné nainstalovat ručně protože nejsou zaregistrovány v repositáři:

source: Deleting backups
cs: Mažu zálohy

source: Deleting %(count)d backups...
cs: Mazání %(count)d záloh ...

source: Deleted %(filename)s...
cs: Smazáno %(filename)s...

source: Deletion of %(filename)s failed, continuing...
cs: Smazání %(filename)s selhalo, pokračuji...

source: Deletion of %(filename)s failed: %(error)s
cs: Smazání %(filename)s selhalo: %(error)s

source: Some plugins during the last restore could not be identified and hence not automatically installed. Please install them manually, they are listed below including their stated homepages:
cs: Během posledního obnovení nebyly některé doplňky identifikovány a proto nebyly automaticky nainstalovány. Prosím nainstalujte je ručně, jsou vypsány níže včetně jejich domovské webové stránky:

source: Delete record of unknown plugins
cs: Smazat záznam neznámých doplňků

source: Existing backups
cs: Existující zálohy

source: There are no backups. Maybe create one below?
cs: Žádné zálohy k dispozici. Chcete ji vytvořit níže?

source: These are the backups of your settings and files that already exist on this OctoPrint instance. You may delete, download or restore them.
cs: Zde jsou zálohy Vašeho nastavení a soubory uložené v této instanci OctoPrintu. Můžete je vymazat, stáhnout nebo obnovit.

source: Delete selected
cs: Smazat vybrané

source: Date
cs: Datum

source: Size
cs: Velikost

source: Delete
cs: Smazat

source: Download
cs: Stáhnout

source: Restore
cs: Obnovit

source: Create backup
cs: Vytvořit zálohu

source: Create a new backup of the current state.
cs: Vytvořit novou zálohu současného stavu.

source: Exclude uploaded files & metadata from backup
cs: Kromě nahraných souborů & metadat ze zálohy

source: Exclude timelapses from backup
cs: Kromě časosběrů ze zálohy

source: Create backup now
cs: Vytvořit zálohu nyní

source: Restore from uploaded backup
cs: Obnovit z nahrané zálohy

source: Restore settings & files from an uploaded backup archive.
cs: Obnovit nastavení & soubory z nahraného záložního archívu.

source: Backup file
cs: Záložní soubor

source: Browse...
cs: Procházet

source: Upload & restore
cs: Nahrát & Obnovit

source: Please note that the operating system that this OctoPrint server is running on does not support automatically restoring backups. You will have to <a href="%(url)s" target="_blank" rel="noopener noreferrer">restore your backups manually for now</a>.
cs: Prosím vezměte na vědomí, že operační systém na kterém běží tento OctoPrint server nepodporuje automatické obnovení ze zálohy. Budete muset <a href="%(url)s" target="_blank" rel="noopener noreferrer">toto obnovení vašich záloh provádět ručně</a>.

source: Without this plugin OctoPrint will no longer be able to perform setup steps that might be required after an update.
cs: Bez tohoto doplňku nebude OctoPrint moci provádět instalační kroky, které by mohly být po aktualizaci vyžadovány.

source: Server Commands
cs: Serverové příkazy

source: Webcam & Timelapse
cs: Web kamera & Časosběr

source: Access Control
cs: Kontrola přístupu

source: Online connectivity check
cs: Kontrola síťového připojení

source: Plugin blacklist
cs: Seznam zakázaných - černá listina - doplňků

source: Default Printer Profile
cs: Výchozí profil tiskárny

source: If you disable Access Control <strong>and</strong> your OctoPrint installation is accessible from the internet, your printer <strong>will be accessible by everyone - that also includes the bad guys!</strong>
cs: Když deaktivuješ Kontrolu Přístupů <strong> a </strong> OctoPrint je dostupný z Internetu, tvoje tiskárna bude <strong> dostupná komukoli - včetně zlých hochů!</strong>

source: Please set up Access Control
cs: Prosím nastav Kontrolu přístupu

source: You haven't yet set up access control. You need to either setup a username and password and click "Keep Access Control Enabled" or click "Disable Access Control" before continuing
cs: Nemáš nastavenu Kontrolu přístupu. Musíš nastavit uživatelské jméno a heslo a stisknout tlačítko "Nevypínat kontrolu přístupu" nebo stiskni tlačítko "Vypnout kontrolu přístupu" před dalším pokračováním

source: Please set up the online connectivity check
cs: Prosím nastav kontrolu síťového připojení

source: You haven't yet decided on whether to enable or disable the online connectivity check. You need to either enable or disable it before continuing.
cs: Dosud jste se nerozhodli, zda zapnete nebo zakážete kontrolu online připojení. Předtím, než budete pokračovat, musíte ji zapnout nebo zakázat.

source: Please set up the plugin blacklist processing
cs: Nastavte prosím zpracování černé listiny doplňků

source: You haven't yet decided on whether to enable or disable the plugin blacklist processing. You need to either enable or disable it before continuing.
cs: Dosud jste se nerozhodli, zda zapnete nebo vypnete kontrolu doplňků pomocí černé listiny. Předtím, než budete pokračovat, musíte ji zapnout nebo zakázat.

source: <p> <strong>Please read the following, it is very important for your printer's health!</strong> </p> <p> OctoPrint by default ships with Access Control enabled, meaning you won't be able to do anything with the printer unless you login first as a configured user. This is to <strong>prevent strangers - possibly with malicious intent - to gain access to your printer</strong> via an untrustworthy network and using it in such a way that it is damaged or worse (i.e. causes a fire). </p> <p> If you plan on accessing OctoPrint remotely over the internet, <strong>you should not only rely on the built-in Access Control mechanisms</strong> however - <a href="%(safe_remote_url)s" target="_blank" rel="noopener noreferrer">take additional precautions</a>. Your OctoPrint enabled printer is a critical home appliance you really should not give anyone who happens to be connected to the internet access to - even read-only! <strong>An instance available publicly on the internet will be found, and people will try to break it open.</strong> </p> <p> It looks like you haven't configured access control yet. Please <strong>set up a username and password</strong> for the initial administrator account who will have full access to both the printer and OctoPrint's settings, then click on "Keep Access Control Enabled": </p>
cs: <p> <strong>Prosím čtěte následující text, je velmi důležitý pro bezpečí Vaší tiskárny!</strong> </p> <p> Octoprint má defaultně zapnutou Kontrolu přístupu, což znamená, že bez přihlášení se do tiskárny není možné cokoliv dělat. Toto má <strong>zabránit cizím lidem - případně se zlým úmyslem - získat přístup k tiskárně</strong> prostřednictvím nedůvěryhodných sítí a používat je takovým způsobem, že je mohou poškodit nebo zničit (např. způsobí požár). </p> <p> Pokud chcete vzdáleně přistupovat do OctoPrintu přes internet, <strong>nemůžete pouze spoléhat na zabudovanou Kontrolu přístupu</strong>ale také <a href="%(safe_remote_url)s" target="_blank" rel="noopener noreferrer">provést další opatření</a>. Vaše tiskárna s technologií OctoPrint je kritickým domácím spotřebičem, který byste opravdu neměli zpřístupnit někomu připojenému přes internet - kromě přístupu pouze pro čtení!<strong>Instance dostupná veřejně přes internet bude nalezena a lidé ji zkusí prolomit a zneužít.</strong> </p> <p> Vypadá to, že stále, že stále ještě nemáte nastavenou Kontrolu přístupu. Prosím <strong>nastavte své uživatelské jméno a heslo</strong> pro vstupní administrátorský účet, který bude mít plný přístup k tiskárně i nastavení OctoPrintu a potom klikněte na "Nevypínat Kontrolu přístupu": </p>

source: Username
cs: Uživatelské jméno

source: Password
cs: Heslo

source: Confirm Password
cs: Potvrdit heslo

source: Passwords do not match
cs: Hesla nesouhlasí

source: <p> <strong>Note:</strong> In case that your OctoPrint installation is only accessible from within a trustworthy local network and you don't need Access Control for other reasons, you may alternatively disable Access Control. You should only do this if you are absolutely certain that only people you know and trust will be able to connect to it. </p> <p> <strong>Do NOT underestimate the risk of access from the internet to your printer and OctoPrint instance!</strong> </p>
cs: <p> <strong>Poznámka:</strong> V případě, že je Vaše instalace OctoPrintu přístupná pouze z důvěryhodné sítě a nepotřebujete Kontrolu přístupu z jiných důvodů, můžete případně Kontrolu přístupu vypnout. Udělejte tak ale pouze pokud absolutně důvěřujete lidem, kteří se k ní mohou připojit. </p> <p> <strong>NEPODCEŇUJTE riziko přístupu z internetu do Vaší tiskárny a instalace OctoPrintu!</strong> </p>

source: Disable Access Control
cs: Vypnout Kontrolu přístupu

source: Keep Access Control Enabled
cs: Nevypínat Kontrolu přístupu

source: Access control is <strong class="text-success">enabled</strong>.
cs: Kontrola přístupu je <strong class="text-success">zapnuta</strong>.

source: Access control is <strong class="text-danger">disabled</strong>.
cs: Kontrola přístupu je <strong class="text-danger">vypnuta</strong>.

source: Configure the connectivity check
cs: Nastav kontrolu síťového připojení

source: If it is disabled OctoPrint will always assume to have a working connection to the internet. If that should not actually be the case, server startups, update checks and the like might take longer.
cs: Pokud je vypnuto Octoprint bude předpokládat funkční připojení k internetu. Pokud tomu tak skutečně není, spouštění serveru, kontrola aktualizací a podobně může trvat déle.

source: OctoPrint comes preconfigured to perform the connectivity check every 15 minutes. You may change the value here.
cs: OctoPrint je přednastaven na kontrolu připojení každých 15 minut. Zde je možné hodnotu změnit.

source: OctoPrint comes preconfigured to utilize Google's DNS server <code>8.8.8.8</code>, port 53 for the connectivity check (if it's enabled). If you have concerns about using that, define the IP and port of a different online server that you trust and that has a high availability.
cs: OctoPrint je předkonfigurován pro využití DNS serveru Google <code>8.8.8.8</code>, port 53 pro kontrolu připojení (pokud je zapnuto). Pokud máte obavy ohledně použití tohoto, definujte IP a port jiného online serveru, který má vaši důvěru a vysokou dostupnost.

source: Finally, please decide on whether to enable or disable the connectivity check. You may change the configuration at any time to a later date through Settings > Server right from within OctoPrint.
cs: Nakonec prosím rozhodněte zda zapnout nebo vypnout kontrolu připojení k internetu. Toto nastavení můžete kdykoliv v budoucnu změnit pomocí Nastavení > Server přímo v OctoPrintu.

source: Disable Connectivity Check
cs: Vypnout Kontrolu připojení

source: Enable Connectivity Check
cs: Zapnout Kontrolu připojení

source: Connectivity check is <strong class="text-success">enabled</strong>.
cs: Kontrola připojení je <strong class="text-success">povolena</strong>.

source: Connectivity check is <strong class="text-danger">disabled</strong>.
cs: Kontrola připojení je <strong class="text-danger">zakázána</strong>.

source: Configure plugin blacklist processing
cs: Nastavte kontrolu černé listiny doplňků

source: To protect against known severe issues with certain versions of third party plugins, OctoPrint supports the use of a centralized plugin version blacklist to automatically disable such plugin versions before they can interfere with normal operation, allowing you to uninstall or update them to a newer version.
cs: Chcete-li chránit před známými závažnými problémy s určitými verzemi doplňků třetích stran, podporuje aplikace OctoPrint použití centralizované černé listiny doplňků, aby se tyto verze doplňků automaticky deaktivovaly, než mohou ovlivnit normální provoz, což vám umožní je odinstalovat nebo aktualizovat na novější verzi.

source: By default, OctoPrint will use the blacklist hosted at <code>plugins.octoprint.org/blacklist.json</code> which you can also take a look at in a more human readable format <a href="%(url)s" target="_blank">here</a>.
cs: V základním nastavení OctoPrint bude používat černou listinu umístěnou na <code>plugins.octoprint.org/blacklist.json</code> , na kterou se můžete podívat ve více lidsky čitelném formátu <a href="%(url)s" target="_blank">zde</a>.

source: Please decide whether to allow fetch and use of this centralized blacklist starting with the next server start. You may also change your decision at any time through Settings > Server right from within OctoPrint.
cs: Rozhodněte se, zda povolíte načtení a použití této centralizované černé listiny, která začíná příštím spuštěním serveru Vaše rozhodnutí můžete také kdykoli změnit pomocí možnosti Nastavení > Server přímo v rámci aplikace OctoPrint.

source: Disable Plugin Blacklist Processing
cs: Vypnout kontrolu černé listiny doplňků

source: Enable Plugin Blacklist Processing
cs: Zapnout kontrolu černé listiny doplňků

source: Plugin blacklist processing is <strong class="text-success">enabled</strong>.
cs: Kontrola seznamu černé listiny doplňků je <strong class="text-success">zapnuta</strong>.

source: Plugin blacklist processing is <strong class="text-danger">disabled</strong>.
cs: Kontrola seznamu černé listiny doplňků je <strong class="text-danger">vypnuta</strong>.

source: Set up your printer profile
cs: Nastav profil tiskárny

source: Please make sure the settings below match your printer. If you plan on connecting more than one printer to OctoPrint, you can also configure additional printer profiles under Settings > Printer Profiles
cs: Prosím ujisti se, že provedené nastavení souhlasí s tvojí tiskárnou. Pokud chceš připojovat více než jednu tiskárnu k OctoPrintu, můžeš nastavit další profil tiskárny pomocí Nastavení > Profil tiskárny

source: General
cs: Obecné

source: Print bed & build volume
cs: Tisková podložka & Rozměry tiskového prostoru

source: Axes
cs: Osy

source: Hotend & extruder
cs: Tryska & extruder

source: <p> OctoPrint supports calling external commands in order to restart itself or restarting and/or shutting down the system it is running on. You may configure those here. </p>
cs: <p> OctoPrint podporuje volání externích příkazů pro provedení restartu OctoPrintu nebo restartu a/nebo vypnutí systému. Toto můžeš nastavit zde. </p>

source: OctoPrint related commands
cs: Příkazy vztahující se k OctoPrintu

source: System related commands
cs: Příkazy vztahující se k Systému

source: Webcam &amp; Timelapse Recordings
cs: Web kamera & Nahrávání časosběru

source: <p> If you have a webcam, you may now configure it here. </p>
cs: <p> Pokud máš Web kameru, můžeš ji nyní nastavit zde. </p>

source: Webcam
cs: Web kamera

source: <p> The <strong>Stream URL</strong> is the URL OctoPrint uses to embed the actual webcam stream (which should be an MJPG stream) into the web interface. This needs to be reachable <strong>from your browser</strong>. </p><p> It may be <ul> <li>a fully qualified URL (<code>http://host:port/path</code>),</li> <li>a URL defaulting to the protocol used for accessing the web interface (e.g. <code>//host:port/path</code>),</li> <li>an absolute path on the same host as OctoPrint (e.g. <code>/absolute/path</code>) or</li> <li>a relative path on the same host as OctoPrint (e.g. <code>relative/path</code>)</li> </ul> </p><p> The <strong>Snapshot URL</strong> is the URL OctoPrint uses to fetch single images from the webcam for creating timelapse recordings. This needs to be a fully qualified URL reachable <strong>from the OctoPrint server</strong>. </p>
cs: <p> <strong>URL Streamu</strong> je URL, které OctoPrint používá k vložení aktuálního streamu z web kamery (který může být MJPG stream) do web stránek rozhraní. Ten musí být dosažitelný <strong>z tvého prohlížeče</strong> </p><p> Může to být <ul> <li>plná adresa URL (<code>http://host:port/cesta</code>),</li> <li>nebo výchozí URL protokolu použitého pro přístup na web rozhraní (např. <code>//host:port/cesta</code>),</li> <li>nebo absolutní cesta na stejného hostitele jako OctoPrint (např. <code>/absolutní/cesta</code>) nebo</li> <li>relativní cesta na stejného hostitele jako OctoPrint (např. <code>relativní/cesta</code>)</li> </ul> </p><p> <strong>URL snímků</strong> je URL které OctoPrint používá k získání jednotlivých obrázků z web kamery pro vytvoření časosběru. K tomu je třeba správně nastavená URL dosažitelná <strong>z OctoPrint serveru</strong>. </p>

source: Timelapse Recordings
cs: Nahrávání časosběru

source: <p> To render the snapshots into timelapse recordings, OctoPrint also needs to know the correct <strong>path to FFMPEG</strong>. </p>
cs: <p> Pro převedení snímků do časosběru OctoPrint také potřebuje znát správnou <strong>cestu k FFMPEG</strong>. </p>
