Repository: wojtas26/octoprint
Catalog: messages.po
Languages: cs

source: Without this plugin your OctoPrint instance will no longer be discoverable on the network via Bonjour and uPnP.
cs: Bez tohoto doplňku tvá instalace OctoPrintu nebude moci být vyhledána v síti pomocí funkcí Bonjour a uPnP.

source: Error Tracking
cs: Sledování chyb

source: Enable error reporting?
cs: Povolit hlášení chyb?

source: <p>It looks like you are tracking an OctoPrint RC release channel. It would be great if you would enable error reporting so that any kind of errors that occur with an RC can be looked into more easily. Thank you!</p><p><small>You can find more information on error reporting under Settings > Error Tracking</small></p>
cs: <p>Vypadá to, že máte nastaveno sledování kanálu s vydáním OctoPrintu - RC. Bylo by dobré povolit sledování chyb, aby všechny druhy chyb, které nastanou při používání verze RC bylo možné snadno najít. Děkuji!</p><p><small>Více informací o hlášení chyb můžete najít v "Nastavení" > "Sledování chyb"</small></p>

source: Ignore
cs: Ignorovat

source: You can still enable error tracking via "Settings" > "Error Tracking"
cs: Stále můžete povolit sledování chyb pomocí "Nastavení" > "Sledování chyb"

source: Enable
cs: Povolit

source: <p> Error tracking will cause any logged exceptions in the server and the browser interface to be sent to OctoPrint's <a href="https://sentry.io/" target="_blank" rel="noopener noreferer">Sentry instance</a>. </p> <p> By enabling it you help to gather detailed information on the cause of bugs or other issues. This is especially valuable on release candidates, which is why this plugin will also prompt you to enable error tracking if it detects that you are subscribed to an RC release channel. </p> <p> Please enable this if you are running a release candidate, or are prompted to do so while debugging an issue that you reported. </p>
cs: <p> Sledování chyb způsobí, že budou odeslány všechny zaznamenané výjimky na serveru a rozhraní prohlížeče do služby <a href="https://sentry.io/" target="_blank" rel="noopener noreferer">Sentry</a> v OctoPrintu. </p> <p> Jeho povolením pomůžete shromáždit detailní informace o příčinách chyb a dalších problémů. Toto je velmi důležité zejména ve verzi release candidate (RC), což je důvod, proč Vás doplněk Sledování chyb žádá o zapnutí sledování pokud rozpozná, že jste přihlášeni do kanálu vydání verzí RC. </p> <p> Prosím povolte toto pokud používáte verzi release candidate, nebo jste o to požádání při řešení problému, který jste nahlásili. </p>

source: Enable error tracking
cs: Povolit sledování chyb

source: Please reload the page after enabling/disabling & saving
cs: Prosím načtěte znovu stránku po zapnutí / vypnutí a uložení

source: Random unique instance ID
cs: Náhodné unikátní ID číslo instance

source: Instance ID
cs: ID číslo instance

source: <p> The Error Tracking plugin is using a Sentry instance kindly provided by <a href="https://sentry.io/" target="_blank" rel="noopener noreferer">sentry.io</a>. For information on their service please refer to their <a href="https://sentry.io/security/" target="_blank" rel="noopener noreferer">Security & Compliance documentation</a> and their <a href="https://sentry.io/privacy/" target="_blank" rel="noopener noreferer">Privacy Policy</a>. </p>
cs: <p> Doplněk Sledování chyb používá službu Sentry laskavě poskytnutou <a href="https://sentry.io/" target="_blank" rel="noopener noreferer">sentry.io</a>. Pro informace o této službě zkontrolujte jejich <a href="https://sentry.io/security/" target="_blank" rel="noopener noreferer">Security & Compliance documentation</a> a jejich <a href="https://sentry.io/privacy/" target="_blank" rel="noopener noreferer">Privacy Policy</a>. </p>

source: Without this plugin anonymous users will have read-only access to your OctoPrint instance. Only disable this if you are comfortable with this, your OctoPrint instance is not publicly reachable on the internet and you fully trust everyone who has access to your local network!
cs: Bez tohoto doplňku budou mít anonymní uživatelé pouze přístup ke čtení Vaší instance. Vypněte pouze pokud Vám toto nevadí, Vaše instance OctoPrintu není veřejně dostupná na internetu a plně důvěřujete každému, kdo má přístup do Vaší místní sítě!

source: Please log in
cs: Prosím přihlašte se

source: Incorrect username or password.
cs: Nesprávné uživatelské jméno nebo heslo.

source: Server is currently offline.
cs: Server je nyní offline

source: Reconnect...
cs: Znovu připojování ...

source: Remember me
cs: Zapamatovat si mě

source: Log in
cs: Přihlásit

source: Without this plugin you will no longer be able to retrieve OctoPrint's logs or modify the current logging levels through the web interface.
cs: Bez tohoto doplňku již nebudete moci načítat protokoly OctoPrintu nebo upravovat aktuální úrovně protokolování prostřednictvím webového rozhraní.

source: You are about to delete log file "%(name)s".
cs: Opravdu chcete smazat log soubor "%(name)s"?

source: You are about to delete %(count)d log files.
cs: Opravdu chcete smazat %(count)d log souborů?

source: Deleting log files
cs: Smazat log soubory

source: Deleting %(count)d log files...
cs: Mazání %(count)d log souborů ...

source: Logs
cs: Logy

source: Sort by name
cs: Seřadit podle jména

source: ascending
cs: vzestupně

source: Sort by modification date
cs: Seřadit podle data změny

source: descending
cs: sestupně

source: Sort by file size
cs: Seřadit podle velikosti

source: Logging Levels
cs: Přihlašovací úroveň

source: Level
cs: Úroveň

source: Remove
cs: Odstranit

source: Add
cs: Přidat

source: Pi Support
cs: Podpora Pi

source: Without this plugin OctoPrint will no longer be able to provide additional information about your Pi,which will make it more tricky to help you if you need support.
cs: Bez tohoto doplňku nebude již moci OctoPrint zajišťovat dodatečné informace o Vašem Pi, bude mnohem obtížnější Vám pomoci v případě, že budete potřebovat podporu.

source: running on
cs: spuštěný na

source: Undervoltage. Make sure your power supply and cabling are providing enough power to the Pi.
cs: Podpětí. Zkontrolujte zda Váš zdroj a kabeláž dodávají dostatek energie do Pi

source: Frequency capping due to overheating. Improve cooling of the CPU and GPU.
cs: Frekvence byla snížena z důvodu přehřátí. Zlepšete chlazení procesoru.

source: A blinking symbol indicates a current issue, a non blinking symbol one that was observed some time since the Pi booted up.
cs: Blikající symbol ukazuje aktuální problém, neblikající symbol ukazuje problém, který nastal od nastartování Pi.

source: Click the symbol in the navbar for more information.
cs: Klikněte na symbol v navigační liště pro více informací.

source: About OctoPi
cs: O OctoPi

source: What do the symbols mean?
cs: Co znamenají tyto symboly?

source: Undervoltage
cs: Podpětí

source: Overheat
cs: Přehřátí

source: Please restart OctoPrint after changing any of this plugin's settings.
cs: Prosím restartujte OctoPrint po změně jakéhokoliv nastavení těchto doplňků.

source: Enable under voltage and overheat detection via <code>vcgencmd get_throttled</code>
cs: Povolit zjišťování podpětí a přehřátí pomocí <code>vcgencmd get_throttled</code>

source: This will regularly check with the Pi if something is amiss either with power regulation or CPU/GPU temperature.
cs: Toto bude pravidelně kontrolovat s Pi zda je něco špatně s regulací napájení nebo teplotou procesoru.

source: Command for under voltage/overheat detection
cs: Příkaz pro zjištění podpětí / přehřátí

source: Defaults to <code>/usr/bin/vcgencmd get_throttled</code>. You usually shouldn't have to change this.
cs: Výchozí hodnota je <code>/usr/bin/vcgencmd get_throttled</code>. Obvykle není třeba toto měnit.

source: Plugin Manager
cs: Manažer doplňků

source: There are no plugin notices. Great!
cs: Žádné oznámení doplňků. Skvělé!

source: There is a plugin notice for one of your installed plugins.
cs: Je zde oznámení jednoho z tvých nainstalovaných doplňků

source: There are %(count)d plugin notices for one or more of your installed plugins.
cs: Je zde %(count)d oznámení jednoho nebo více z tvých nainstalovaných doplňků

source: Installing plugin...
cs: Instalace doplňku...

source: Installing plugin from uploaded archive...
cs: Instalování doplňku z uploadnutého archívu...

source: Something went wrong
cs: Něco se pokazilo

source: Please consult octoprint.log for details
cs: Prosím prohlédněte si octoprint.log kvůli detailům

source: You are about to disable "%(name)s".
cs: Opravdu chcete vypnout "%(name)s".

source: This is not recommended
cs: Toto není doporučené

source: Do you still want to disable it?
cs: Stále si to přejete vypnout

source: Keep enabled
cs: Ponechat zapnuté

source: Disable anyway
cs: Přesto vypnout

source: Installing plugin "%(name)s" from %(url)s...
cs: Instalace doplňku "%(name)s" z %(url)s...

source: Installing plugin from %(url)s...
cs: Instalace doplňku z %(url)s...

source: Reinstalling plugin...
cs: Reinstalování doplňku...

source: Reinstalling plugin "%(name)s" from %(url)s...
cs: Reinstalování doplňku "%(name)s" z %(url)s...

source: Uninstalling plugin...
cs: Odinstalování doplňku...

source: Uninstalling plugin "%(name)s"
cs: Odinstalování doplňku "%(name)s"

source: Reinstall
cs: Reinstalace

source: Install
cs: Instalace

source: Disabled
cs: Vypnuto

source: Incompatible
cs: Nekompatibilní

source: Plugin management log
cs: Log Manažeru doplňků

source: %(count)d earlier actions...
cs: %(count)d dřívějších akcí ...

source: %(count)d earlier action
cs: %(count)d dřívější akce

source: Install <em>%(plugin)s</em>: %(result)s
cs: Instalovat <em>%(plugin)s</em>:%(result)s

source: Uninstall <em>%(plugin)s</em>: %(result)s
cs: Odinstalovat <em>%(plugin)s</em>:%(result)s

source: Enable <em>%(plugin)s</em>: %(result)s
cs: Povolit <em>%(plugin)s</em>:%(result)s

source: Disable <em>%(plugin)s</em>: %(result)s
cs: Vypnout <em>%(plugin)s</em>:%(result)s

source: A restart is needed for the changes to take effect.
cs: Je nutný restart pro provedení změn.

source: Restart now
cs: Restartovat nyní

source: <strong>This will restart your OctoPrint server.</strong></p><p>This action may disrupt any ongoing print jobs (depending on your printer's controller and general setup that might also apply to prints run directly from your printer's internal storage).
cs: <strong>Toto provede restart OctoPrint serveru.</strong></p><p>Toto může přerušit probíhající tiskové úlohy (v závislosti na řízení Vaší tiskárny a hlavním nastavení kde je možno zvolit tisk přímo z vnitřní paměti tiskárny).

source: Restart in progress
cs: Probíhá restart

source: The server is now being restarted in the background
cs: Server je nyní restartován na pozadí

source: Trying to restart the server produced an error, please check octoprint.log for details. You'll have to restart manually.
cs: Pokus o restartování serveru způsobil chybu, zkontroluj prosím octoprint.log pro další podrobnosti. Je třeba provést restart ručně.

source: A refresh is needed for the changes to take effect.
cs: Je nutné obnovení pro provedení změn.

source: Reload now
cs: Znovu načíst

source: A reconnect to the printer is needed for the changes to take effect.
cs: Je nutné znovu připojení k tiskárně pro provedení změn.

source: Error!
cs: Chyba!

source: Done!
cs: Hotovo!

source: Blacklisted
cs: Na černé listině

source: Disabled due to active safe mode
cs: Vypnuto z důvodu aktivního bezpečného modu

source: Enable Plugin
cs: Povolit doplněk

source: Disable Plugin
cs: Zakázat doplněk

source: There are %(count)d notices (%(important)d marked as important) available regarding this plugin - click to show!
cs: Je zde %(count)d oznámení (%(important)d označených jako důležité) týkajících se tohoto doplňku - klikni pro zobrazení!

source: There are %(count)d notices available regarding this plugin - click to show!
cs: Je zde %(count)d oznámení týkajících se tohoto doplňku - klikni pro zobrazení!

source: There is an important notice available regarding this plugin - click to show!
cs: Je zde důležité oznámení týkající se tohoto doplňku - klikni pro zobrazení!

source: There is a notice available regarding this plugin - click to show!
cs: Je zde oznámení týkající se tohoto doplňku - klikni pro zobrazení!

source: Important notice regarding plugin "%(name)s"
cs: Důležité oznámení týkající se doplňku "%(name)s"

source: Notice regarding plugin "%(name)s"
cs: Oznámení týkající se doplňku "%(name)s"

source: Affected versions: %(versions)s
cs: Dotčené verze: %(versions)s

source: Affected versions: all
cs: Dotčené verze: všechny

source: Read more...
cs: Číst více...

source: Take note that all plugin management functionality is disabled while your printer is printing.
cs: Mějte na paměti, že manažer doplňků není aktivní, když tiskárna tiskne.

source: The <code>pip</code> command could not be found or does not work correctly for this installation of OctoPrint - please consult the log file for details and if necessary configure it manually. No installation and uninstallation of plugin packages is possible while <code>pip</code> is unavailable.
cs: Přikaz <code>pip</code> nebyl nalezen, nebo nepracuje správně pro tuto instalaci OctoPrintu - prosím zkontroluj log soubor pro podrobnosti a pokud je to nezbytné, proveď ruční nastavení. Není možná žádná instalace ani odinstalování doplňků dokud příkaz <code>pip</code> nefunguje.

source: Safe mode is currently active. All third party plugins are disabled and cannot be enabled. Installation of plugin packages is disabled.
cs: Bezpečný mod je nyní aktivní. Všechny doplňky třetích stran jsou nyní vypnuty a nemohou být aktivovány. Instalace doplňků je nyní vypnuta.

source: It looks like OctoPrint has currently no connection to the internet. Due to that it's not possible to install new plugins from the plugin repository or archive URLs.
cs: Vypadá to, že Octoprint momentálně nemá připojení k internetu. Proto není možné instalovat nové doplňky z repozitáře nebo URL.

source: Plugin Configuration
cs: Nastavení doplňku

source: Installed Plugins
cs: Nainstalované doplňky

source: Bundled with OctoPrint
cs: Svázáno s OctoPrintem

source: Cannot be uninstalled through OctoPrint
cs: Nemůže být odinstalováno pomocí OctoPrintu

source: Restart of OctoPrint needed for changes to take effect
cs: Restart OctoPrintu je třeba pro provedení změn

source: Pending install
cs: Probíhající instalace

source: Pending uninstall
cs: Probíhající odinstalace

source: Disabled due to safe mode
cs: Vypnuto z důvodu bezpečného modu

source: There are notices available regarding this plugin
cs: Jsou dostupná oznámení k tomuto doplňku

source: This plugin is blacklisted
cs: Tento doplněk je na černé listině

source: Homepage
cs: Domácí stránka

source: Uninstall Plugin
cs: Odinstalovat doplněk

source: Get More...
cs: Získat více...

source: Reshow current notices
cs: Znovu zobrazit současná oznámení

source: Refresh notices from repository
cs: Obnovit oznámení z repositáře

source: Install new Plugins...
cs: Nainstalovat nové doplňky...

source: ... from the <a href="%(url)s" target="_blank">Plugin Repository</a>
cs: ... ze <a href="%(url)s" target="_blank">Seznamu doplňků</a>

source: Sort by title
cs: Seřadit podle názvu

source: Sort by publication date
cs: Seřadit podle data

source: Only show uninstalled plugins
cs: Zobrazit pouze odinstalované doplňky

source: Only show compatible plugins
cs: Zobrazit pouze kompatibilní doplňky

source: Refresh list from repository
cs: Aktualizovat list seznamu

source: Search...
cs: Hledat...

source: Details
cs: Detaily

source: "Why?"
cs: "Proč?"

source: Sadly the repository is currently not available
cs: Bohužel repozitář není nyní dostupný

source: Is your OctoPrint installation connected to the internet?
cs: Je tato Octoprint instance připojená k internetu?

source: ... from URL
cs: ... z adresy

source: Enter URL...
cs: Vložit adresu...

source: This does not look like a valid URL. Expected http, https or any of the <a href="%(url)s" target="_blank">supported VCS URLs</a>.
cs: Toto nevypadá jako platná adresa URL. Předpokládá se http, https nebo jiný z <a href="%(url)s" target="_blank">podporovaných předpon adres</a>.

source: ... from an uploaded archive
cs: ...z uploadovaného archívu

source: This does not look like a valid plugin archive. Valid plugin archives should be either zip files or tarballs and have the extension ".zip", ".tar.gz", ".tgz" or ".tar"
cs: Chybná přípona. Povolené přípony jsou zip, tar.gz, tgz nebo tar

source: Use <code>--process-dependency-links</code> with <code>pip install</code>
cs: Použijte <code>--process-dependency-links</code> s <code>pip install</code>

source: You should normally <strong>not</strong> have to change <strong>any</strong> of the following settings, they are purely provided for convenience here.
cs: Normálně <strong>není</strong> nutné provádět <strong>žádné</strong> z následujících nastavení, jsou zde uvedena pouze pro větší pohodlí.

source: Plugin repository configuration
cs: Nastavení repositáře doplňků

source: URL of the Plugin Repository to use. You should normally not have to change this.
cs: URL adresa repozitáře s doplňky. Za normálních okolností netřeba měnit.

source: Repository URL
cs: URL repozitáře

source: How long to cache repository data, in minutes. You should normally not have to change this.
cs: Jak dlouho se mají ukládat cache data, v minutách. Za normálních okolností netřeba měnit.

source: Repository cache TTL
cs: TTL cache repozitáře

source: Notices configuration
cs: Nastavení oznámení

source: URL of the Notices source to use. You should normally not have to change this.
cs: URL zdroje oznámení. Normálně není nutno měnit

source: Notices URL
cs: Oznámení URL

source: How long to cache notices, in minutes. You should normally not have to change this.
cs: Doba mezipaměti oznámení v minutách. Normálně není nutno měnit

source: Notices cache TTL
cs: Oznámení cache TTL

source: pip configuration
cs: Nastavení příkazu pip

source: Additional arguments for the pip command. You should normally not have to change this.
cs: Další argumenty pro příkaz pip. Normálně není třeba toto měnit.

source: Additional arguments
cs: Další argumenty

source: Force the use of the <code>--user</code> flag with <code>pip install</code>
cs: Vynucené použití <code>--user</code> příznaku pro <code>pip install</code>

source: Cancel
cs: Zrušit

source: Save
cs: Uložit

source: Printer Safety Warning
cs: Bezpečnostní varování tiskárny

source: Without this plugin OctoPrint will no longer be able to check if the printer it is connected to has a known safetyissue and inform you about that fact.
cs: Bez tohoto doplňku OctoPrint již nebude moci kontrolovat, zda má připojená tiskárna známý problém týkající se bezpečnosti a informovat vás o této skutečnosti.

source: Your printer's firmware is known to lack mandatory safety features (e.g. thermal runaway protection). This is a fire risk.
cs: Váš firmware tiskárny neobsahuje povinné bezpečnostní prvky (např. Ochrana proti tepelnému úniku). Zde je možné riziko požáru.

source: Warning!
cs: Varování!

source: Learn more...
cs: Zjistit více ...

source: setuptools
cs: Nastavovací nástroj

source: Software Update
cs: Aktualizace programu

source: Without this plugin OctoPrint will no longer be able to update itself or any of your installed plugins which might put your system at risk.
cs: Bez tohoto doplňku nebude moci OctoPrint provést úpravu sebe nebo jakéhokoliv nainstalovaného doplňku, který by systém mohl ohrozit.

source: unknown
cs: neznámý

source: Updating...
cs: Aktualizuji...

source: Updating, please wait.
cs: Aktualizuji, prosím vyčkej.

source: There are updates available for the following components:
cs: Jsou dostupné aktualizace pro tyto součásti:

source: Release Notes
cs: Poznámky k verzi

source: This version of the Python environment is not supported for direct updates.
cs: Tato verze prostředí Python není podporována přímou aktualizací.

source: Those components marked with <i class="fa fa-check"></i> can be updated directly.
cs: Komponenty označené <i class="fa fa-check"></i> mohou být aktualizovány přímo.

source: To have updates applied, get in touch with an administrator of this OctoPrint instance.
cs: Chcete-li použít aktualizace, obraťte se na správce této instance OctoPrintu.

source: Update Available
cs: Dostupná aktualizace

source: You can make this message display again via "Settings" > "Software Update" > "Check for update now"
cs: Zprávu můžete znovu zobrazit pomocí "Nastavení" > "Aktualizace programu" > "Zkontrolovat aktualizace nyní"

source: Update now
cs: Aktualizovat nyní

source: Everything is up-to-date
cs: Vše je aktuální

source: No internet connection
cs: Žádné připojení k internetu

source: Update not possible
cs: Aktualizace není možná

source: Unknown update check, configuration ok?
cs: Neznámá kontrola aktualizace, je správná konfigurace?

source: Cannot check for update, need online connection
cs: Nemohu zkontrolovat aktualizace, potřebuji připojení k internetu

source: Network error while checking for update
cs: Chyba sítě při kontrole aktualizací

source: Unknown error while checking for update, please check the logs
cs: Neznámá chyba při kontrole aktualizací, prosím zkontrolujte logy.

source: Now updating, please wait.
cs: Probíhá aktualizace prosím čekejte.

source: Update not started!
cs: Aktualizace nezačala!

source: The update could not be started. Is it already active? Please consult octoprint.log for details.
cs: Aktualizace nemohla být spuštěna. Je stále aktivní? Prosím zkontrolujte octoprint.log pro více podrobností.

source: Can't update while printing
cs: Při tisku nelze aktualizovat.

source: A print job is currently in progress. Updating will be prevented until it is done.
cs: Probíhá tisk. Aktualizace bude provedena až tisk skončí.

source: This will update the following components and restart the server:
cs: Toto aktualizuje následující části a pak restartuje server:

source: Be sure to read through any linked release notes, especially those for OctoPrint since they might contain important information you need to know <strong>before</strong> upgrading.
cs: Určitě si přečtěte všechny poznámky, které se vztahují k tomuto vydání OctoPrintu. Mohou obsahovat důležité informace, které potřebujete znát <strong>ještě před</strong> vlastní aktualizací.

source: This action may disrupt any ongoing print jobs.
cs: Tato akce může narušit všechny probíhající tiskové úlohy.

source: Depending on your printer's controller and general setup, restarting OctoPrint may cause your printer to be reset.
cs: V závislosti na nastavení tiskárny a hlavního nastavení, restartování OctoPrintu může způsobit reset tiskárny.

source: Are you sure you want to proceed?
cs: Jsi si jistý že chceš pokračovat?

source: Are you sure you want to update now?
cs: Jsi si jistý, že chceš aktualizaci spustit právě teď?

source: Proceed
cs: Pokračovat

source: Now updating %(name)s to %(version)s
cs: Aktualizace %(name)s na %(version)s

source: Update successful, restarting!
cs: Aktualizace úspěšná, restartování!

source: The update finished successfully and the server will now be restarted.
cs: Aktualizace proběhla úspěšně a server teď bude restartován.

source: Restart failed
cs: Restart selhal

source: The server apparently did not restart by itself, you'll have to do it manually. Please consult octoprint.log on what went wrong.
cs: Server se zřejmě nerestartoval sám, budete jej muset restartovat ručně. Prosím zkontrolujte octoprint.log co se stalo.

source: The update finished successfully, please restart OctoPrint now.
cs: Aktualizace proběhla úspěšně, prosím restartujte OctoPrint.

source: The update finished successfully, please reboot the server now.
cs: Aktualizace proběhla úspěšně, prosím restartujte server.
