Repository: wojtas26/octoprint
Catalog: messages.po
Languages: cs

source: Auto-connect to printer on server start
cs: Po startu automaticky připojit k tiskárně

source: Additional serial ports
cs: Další sériové porty

source: Use this to define additional <a href="%%(glob_url)s">glob patterns</a> matching serial ports to list for connecting against, e.g. <code>/dev/ttyAMA*</code>. One entry per line.
cs: Tuto možnost využijete pro nastavení dalších sériových portů <a href="%%(glob_url)s">vzory</a> pro vytvoření seznamu pro znovu připojení, např.:<code>/dev/ttyAMA*</code>. Jedna položka na každém řádku.

source: Additional baud rates
cs: Další komunikační rychlosti

source: Use this to define additional serial port baud rates to list for connecting with, e.g. <code>123456</code>. Comma separated.
cs: Použij toto pro nastavení dalších komunikačních rychlostí sériových portů pro seznam pro připojení, např. <code>123456</code>. Oddělované čárkou.

source: Serial logging
cs: Protokolování sériové komunikace

source: Log communication to <code>serial.log</code>
cs: Ukládání komunikace do <code>serial.log</code>

source: While this can negatively impact performance, a <code>serial.log</code> can be incredibly useful for debugging any issues observed in the communication between OctoPrint and your printer.
cs: I když toto má špatný vliv na výkon, může být <code>serial.log</code> užitečný pro odstranění všech problémů souvisejících s komunikací mezi OctoPrintem a tiskárnou.

source: Query intervals
cs: Intervaly dotazování

source: Interval in which to poll for the temperature information from the printer
cs: Interval dotazování se informací o teplotě z tiskárny

source: Temperature interval (polling)
cs: Interval měření teploty (polling)

source: When printing or idle
cs: Když tiskne nebo čeká

source: When idle and a target temperature is set
cs: Pokud je nastavena čekací a cílová teplota

source: Temperature report interval to request from autoreport capable firmwares. A value of 0 disables autoreporting by the firmware and forces polling.
cs: Interval hlášení teploty umožňuje vyžádání z firmwaru který podporuje automatické hlášení. Hodnota 0 vypne automatické hlášení z firmwaru a zapne dotazování.

source: Temperature interval (autoreport)
cs: Interval měření teploty (autoreport)

source: Autoreport interval to request from firmware
cs: Interval automatického hlášení z firmwaru

source: Interval in which to poll for the SD printing status information from the printer while printing
cs: Interval dotazování se stavu tisku při tisku z SD karty

source: SD status interval (polling)
cs: Interval kontroly stavu SD (polling)

source: When printing from the printer's SD
cs: Pokud se tiskne z SD slotu tiskárny

source: SD status interval to request from autoreport capable firmwares. A value of 0 disables autoreporting by the firmware and forces polling.
cs: Interval hlášení stavu SD umožňuje vyžádání z firmwaru který podporuje automatické hlášení. Hodnota 0 vypne automatické hlášení z firmwaru a zapne dotazování.

source: SD status interval (autoreport)
cs: Interval stavu SD (autoreport)

source: Timeouts
cs: Timeouty

source: Time after which the communication with your printer will be considered timed out if nothing was sent by your printer (and an attempt to get it talking again will be done). Increase this if your printer takes longer than this for some moves.
cs: Čas po němž se tiskárna považuje za nedostupnou, poté co nebyla přijata žádná komunikace od tiskárny (a proběhl opakovaný pokus o komunikaci). Lze zvětšit, pokud tiskárna potřebuje delší čas na některé pohyby.

source: Communication timeout
cs: Vypršel časový limit komunikace

source: <code>busy</code> protocol support not detected
cs: Podpora protokolu <code>busy</code> nebyla detekována

source: <code>busy</code> protocol support detected
cs: Podpora protokolu <code>busy</code> byla detekována

source: Time after which a connection attempt to the printer will be considered as having failed
cs: Čas po němž se pokusy o připojení prohlásí za nemožné.

source: Connection timeout
cs: Vypršel časový limit připojení

source: Time after which to consider an auto detection attempt to have failed if no successful connection is detected
cs: Čas po kterém se prohlásí pokusy o automatické připojení jako nemožné.

source: Autodetection timeout
cs: Časový limit autodetekce

source: Time after which to consider a position query on pause or cancel to have failed
cs: Doba pro určení, že se příkaz pro Pauzu nebo zrušení tisku nezdařil

source: Position query timeout
cs: Timeout pojezdu

source: Time to wait after opening the serial connection before starting baudrate detection
cs: Čas čekání po otevření sériového připojení před zahájením zjišťování rychlosti komunikace

source: Initial baudrate detection pause
cs: Čekání před zjišťováním rychlosti komunikace

source: Some controllers need a bit of a breather before baudrate detection after initial connect. If baudrate detection fails due to a hanging controller, try increasing this value.
cs: Některé kontrolery potřebují více času po připojení před detekcí rychlosti komunikace. Pokud zjišťování rychlosti komunikace selže, zkuste zvýšit tuto hodnotu.

source: Maximum consecutive communication timeouts while idle. More than this and the printer will be considered to be gone. Set to 0 to disable.
cs: Maximum po sobě jdoucích komunikačních problémů, zatímco tiskárna netiskne. Při větším počtu bude tiskárna považována za odpojenou. Nastavte 0 pro vypnutí.

source: Max. consecutive timeouts while idle
cs: Maximum po sobě jdoucích komunikačních problémů, zatímco tiskárna netiskne

source: Set to 0 to disable consecutive timeout detection and handling.
cs: Nastavte na 0 pro vypnutí po sobě jdoucí detekce a manipulace časového limitu.

source: Maximum consecutive communication timeouts while printing. More than this and the printer will be considered to be gone. Set to 0 to disable.
cs: Maximum po sobě jdoucích komunikačních problémů, zatímco tiskárna tiskne. Při větším počtu bude tiskárna považována za odpojenou. Nastavte na 0 pro vypnutí.

source: Max. consecutive timeouts while printing
cs: Maximum po sobě jdoucích komunikačních problémů, zatímco tiskárna tiskne

source: Maximum consecutive communication timeouts while a long running command is active. More than this and the printer will be considered to be gone. Set to 0 to disable.
cs: Maximum po sobě jdoucích komunikačních problémů, zatímco byl poslán některý z dlouho trvajících příkazů. Při větším počtu bude tiskárna považována za odpojenou. Nastavte na 0 pro vypnutí.

source: Max. consecutive timeouts during long running commands
cs: Maximum po sobě jdoucích komunikačních problémů, zatímco byl poslán některý z dlouho trvajících příkazů

source: Firmware specific settings
cs: Nastavení specifické pro Firmware

source: Enable automatic firmware detection
cs: Povol automatickou detekci firmwaru

source: If enabled, OctoPrint will try to figure out your printer's firmware automatically and adjust some communication parameters based on that. If that doesn't work out, or you want more granular control, uncheck this and the parameters in question will become visible for you to adjust.
cs: Pokud je povoleno, Octoprint se pokusí určit firmware Vaší tiskárny automaticky a nastavit podle toho některé komunikační parametry. Pokud toto nefunguje, nebo potřebujete lepší kontrolu - odškrtněte toto a parametry budou viditelné pro nastavení.

source: Select SD files by relative path
cs: Vyber soubory na SD kartě pomocí relativní cesty

source: Always assume SD card is present
cs: Vždy předpokládat přítomnost SD karty

source: Ignore consecutive resend requests for the same line
cs: Ignorovat souběžné příkazy pro znovu zaslání stejného řádku gcode.

source: Support <code>TargetExtr%%n</code>/<code>TargetBed</code> target temperature format
cs: Podporovat <code>TargetExtr%%n</code>/<code>TargetBed</code> formát zasílání teploty

source: Disable detection of external heatups
cs: Vypnout detekci externích rozehřívačů

source: Actively pause communication during <code>G4</code> dwell command
cs: Aktivně pozastavená komunikace během <code>G4</code> dwell příkazu

source: Send a checksum with the command
cs: Poslat kontrolní součet s příkazem

source: When printing
cs: Když tiskne

source: Support temperature autoreporting by firmware, if detected
cs: Podpora automatického hlášení teploty pomocí firmwaru, pokud je toto detekováno

source: Support sd status autoreporting by firmware, if detected
cs: Podpora automatického hlášení stavu SD pomocí firmwaru, pokud je toto detekováno

source: Send emergency GCODES <code>M108</code> and <code>M410</code> without waiting for acknowledgement, if detected as supported by the firmware
cs: Posílá emergency G kod <code>M108</code> a <code>M140</code> bez čekání na potvrzení, pokud je zjištěna podpora ve firmwaru

source: Support <code>busy</code> protocol, if detected
cs: Podpora <code>busy</code> protokolu, pokud je detekována

source: Simulate <code>ok</code> for <code>M29</code>
cs: Simulovat <code>ok</code> pro <code>M29</code>

source: Most Marlin forks that were derived from Marlin versions &lt; v1.1.0 do not send an acknowledging <code>ok</code> for a <code>M29</code>. Check this if you run into communication stalls following streaming of a file to your printer's SD.
cs: Většina verzí Marlinu odvozených od verze Marlin v1.1.0 neposílá potvrzení <code>ok</code> pro příkaz <code>M29</code>. Zaškrtněte toto pokud máte problémy se zasekáváním komunikace při nahrávání souborů na SD kartu tiskárny.

source: Simulate <code>ok</code> for resend requests
cs: Simulování <code>ok</code> pro znovu odeslání požadavku

source: If detected as necessary
cs: Pokud je detekováno jako nezbytné

source: Some Marlin forks lack an acknowledging <code>ok</code> with their resend requests. Set this to "always" or "if detected as necessary" if you run into communication stalls on resend requests.
cs: Některé verze firmwaru Marlin postrádají potvrzující <code>ok</code> při znovu odeslání požadavku. Nastavte toto na "Vždy" nebo "Pokud je detekováno jako nezbytné" pokud zjistíte zastavení komunikace při znovu odeslaném požadavku.

source: Protocol fine tuning
cs: Detailní nastavení protokolu

source: Wait for <code>start</code> on connect
cs: Počkat na <code>start</code> po připojení

source: Try checking this if you run into connection timeouts due to your printer taking too long to respond to OctoPrint's handshake attempts on connect.
cs: Můžete toto zaškrtnout, pokud máte problémy s výpadky komunikace z důvodu příliš dlouhé odezvy tiskárny na pokusy OctoPrintu o komunikaci.

source: Blocked commands
cs: Zakázané příkazy

source: Use this to specify commands that should never be sent to the printer. Just the G or M code, comma separated. Defaults to <code>M0</code> and <code>M1</code> since most firmware will block until a button on the controller has been pressed if it receives either of those two commands.
cs: Toto použijte pro zadání příkazů, které nesmí být nikdy odeslány do tiskárny. Pouze G a M kódy oddělené středníkem. hodnota je <code>M0</code> a <code>M1</code> protože většina firmwarů bude blokována do stisknutí tlačítka na ovladači pokud přijme kterýkoliv z těchto kódů.

source: Pausing commands
cs: Přerušovací příkazy

source: Use this to specify commands on which OctoPrint should pause the print job. Just the G or M code, comma separated. Defaults to <code>M0</code>, <code>M1</code> and <code>M25</code>.
cs: Toto použijte pro zadání příkazů po kterých OctoPrint pozastaví tiskovou úlohu. Pouze G a M kódy oddělené středníkem. hodnota je </code>M0</code>, <code>M1</code> a <code>M25</code>.

source: Command to send to the firmware on first handshake attempt.
cs: Příkaz, který se odešle firmwaru při prvním navázání komunikace.

source: "Hello" command
cs: Příkaz "Hello"

source: Use this to specify a different command than the default <code>M110</code> to send to the printer on initial connection to trigger a communication handshake.
cs: Zde se zadává jiný příkaz než je výchozí <code>M110</code>, který se posílá tiskárně během úvodního připojení a který startuje komunikaci.

source: Commands that are know to run long and hence should suppress communication timeouts from being triggered.
cs: Příkazy které trvají dlouho a na které by se proto neměly vztahovat časové limity komunikace.

source: Long running commands
cs: Dlouho trvající příkazy

source: Use this to specify the commands known to take a long time to complete without output from your printer and hence might cause timeout issues. Just the G or M code, comma separated.
cs: Určete, které příkazy trvají dlouho a na které by se proto neměly vztahovat časové limity komunikace. Pouze G a M kódy oddělené čárkou.

source: Commands that always require a line number and checksum to be sent with them.
cs: Tyto příkazy vždy při poslání vyžadují číslo řádku a kontrolní součet.

source: Commands that always require a checksum
cs: Tyto příkazy vždy vyžadují kontrolní součet

source: Use this to specify which commands <strong>always</strong> need to be sent with a checksum. Comma separated list.
cs: Zde urči, které příkazy musí být <strong>vždy</strong> poslány s kontrolním součtem Seznam oddělený čárkami.

source: Error handling
cs: Zpracování chyb

source: What to do on a firmware error (<code>Error:</code> or <code>!!</code>)
cs: Co dělat při chybě firmwaru (<code>Error:</code> nebo <code>!!</code>)

source: Disconnect from the printer
cs: Odpojeno od tiskárny

source: Cancel any ongoing prints but stay connected to the printer
cs: Zrušit všechny probíhající tisky, ale zůstat připojen k tiskárně

source: Please note that if you choose this, OctoPrint will still disconnect from the printer in case of <em>fatal</em> errors reported by your firmware (e.g. <code>kill() called</code>, <code>fatal:</code>).
cs: Prosím vezměte na vědomí, že když zvolíte toto, OctoPrint se bude pořád odpojovat z tiskárny v případě <em>fatálních</em> chyb hlášených firmwarem (např. <code>kill() called</code>, <code>fatal:</code>).

source: Only choose this if your firmware sends error messages that are not actual errors. Might mask printer issues (even fatal errors!), be careful!
cs: Toto vypněte pouze pokud firmware zasílá chybová hlášení, která nejsou skutečnou chybou. Může skrývat problém s tiskárnou ( dokonce fatální chybu!), buďte opatrní!

source: Log position on pause
cs: Uložit pozici při pauze

source: If you disable this, the <code>pause_position</code> placeholders in your pause/resume GCODE scripts will stay unpopulated! However, pausing speed might improve slightly.
cs: Pokud tuto funkci deaktivujete, zůstávají zástupné znaky<code>pause_position</code> ve skriptech GCODE pozastavené / obnovené. Rychlost pozastavení tisku se však mírně zlepší.

source: Log position on cancel
cs: Uložit pozici při zrušení

source: If you disable this, the <code>cancel_position</code> placeholders in your cancel GCODE script and the corresponding data in the print recovery data will stay unpopulated! However, cancelling speed might improve slightly.
cs: Pokud toto zakážete, budou zástupné symboly <code>cancel_position</code> uložené ve skriptu GCODE zrušení a odpovídající údaje v datech pro obnovu tisku zůstanou nezastavené! Rychlost zrušení tisku se však může mírně zlepšit.

source: Attempt to abort any blocking heatups on cancel via <code>M108</code>.
cs: Pokus o přerušení zablokovaného zahřívání nebo jeho zrušení pomocí <code>M108</code>.

source: Uncheck this if your firmware doesn't support <code>M108</code> for aborting blocking heatups!
cs: Zde odškrtnout pokud Váš firmware nepodporuje <code>M108</code> pro přerušení zablokovaného zahřívání!

source: Commands
cs: Příkazy

source: Connectivity check
cs: Kontrola připojení

source: Plugin blacklist processing
cs: Kontrola černé listiny doplňků

source: Graph
cs: Graf

source: Graph cutoff
cs: Délka zobrazovaného grafu teplot

source: Needs a restart of OctoPrint to become active.
cs: Je potřeba restartovat OctoPrint, aby se změna promítla.

source: Fine adjustments
cs: Jemné nastavení

source: Send temperature fine adjustments automatically
cs: Posílat jemné úpravy teploty automaticky

source: Enable this to have temperature fine adjustments you do via the + or - button be sent to the printer automatically.
cs: Zapnout pro povolení jemných úprav teploty pomocí tlačítek + a - posílaných do tiskárny automaticky

source: Sending delay
cs: Poslat zpoždění

source: OctoPrint will use this delay to limit the number of sent temperature commands should you perform multiple fine adjustments in a short time.
cs: OctoPrint použije toto zpoždění pro omezení počtu teplotních příkazů umožňujících jemné nastavení v krátké době.

source: Presets
cs: Předvolby

source: RegExp
cs: Regulární výraz

source: If you do not wish to change your password, just leave the following fields empty.
cs: Nechceš-li měnit svoje heslo, ponechej následující pole prázdná.

source: Please note that changes to the API key are applied immediately, without having to "Confirm" first.
cs: Vezměte prosím na vědomí, že změny klíče API se použijí okamžitě, aniž byste museli nejprve stisknout "Potvrdit".

source: Language
cs: Jazyk

source: Changes to the interface language will only become active after a reload of the page.
cs: Změna jazyka se stane aktivní až po obnovení stránky.

source: All Done!
cs: Vše hotovo

source: Your OctoPrint installation is now all set up and ready to go.
cs: Vaše instalace OctoPrintu je nyní kompletně nastavena a připravena k použití.

source: For your printer's safety
cs: Pro zabezpečení Vaší tiskárny

source: Even with OctoPrint attached you should <strong class="text-error">never leave your printer running completely unattended</strong>. The electronics in our consumer printers can and sometimes sadly do catch fire, so stay or have someone else stay close enough to physically intervene in case of such catastrophic failure.
cs: Dokonce ani s funkčním OctoPrintem <strong class="text-error">nikdy nenechávejte Vaši tiskárnu bez dozoru</strong>. Elektronika v našich tiskárnách může a bohužel někdy i vzplane a proto někoho nechte nebo zůstaňte dostatečně blízko, aby jste mohli zasáhnout v případě nějakého katastrofického selhání.

source: You also should <strong class="text-error">never make your OctoPrint instance available for everyone on the public internet</strong>, even with Access Control enabled. Your instance <em>will</em> be found, and bad people <em>will</em> try to abuse it. Don't put yourself at risk, <a href="%(url)s" target="_blank" rel="noopener noreferrer">use a safe way to access your instance remotely</a>.
cs: Nikdy také <strong class="text-error">nesmíte zpřístupnit Vaši instanci OctoPrintu pro kohokoliv na veřejném internetu</strong>, pokud je zapnuta Kontrola přístupu. Vaše instance <em>bude</em> nalezena a zlí lidé <em>ji zkusí</em> zneužít. Nevystavujte se riziku, <a href="%(url)s" target="_blank" rel="noopener noreferrer">používejte bezpečný způsob pro vzdálený přístup do instance</a>.

source: If you enjoy OctoPrint...
cs: Pokud se Vám OctoPrint líbí ...

source: Please consider <strong><a href="%(url)s" target="_blank">supporting OctoPrint's ongoing development</a></strong>, which can only continue with funding by users like you! You can also find this link in the "About" dialog.<br> <strong>Thank you!</strong>
cs: Prosím zvažte <strong><a href="%(url)s" target="_blank">podporu probíhajícího vývoje OctoPrintu</a></strong>, který může pokračovat jen díky podpoře uživatelů jako Vy! Tento link také můžete najít v dialogu "O programu".<br> <strong>Děkuji</strong>

source: With all that being said, <strong>Happy and Safe Printing</strong>!
cs: Se vším co bylo uvedeno, <strong>Šťastný a bezpečný tisk</strong>!

source: Hello!
cs: Ahoj!

source: Thank you for installing OctoPrint!
cs: Díky za instalaci OctoPrintu!

source: This wizard will guide you through the final steps to get your OctoPrint instance all set up and ready to go. We'll get you printing in no time!
cs: Tento průvodce Vás provede posledními kroky nastavení vaší instalace OctoPrintu a připraví jej k použití. Pomůže Vám tisknout ihned!

source: Forgot password?
cs: Zapomenuté heslo?

source: User Settings
cs: Uživatelská nastavení

source: Logout
cs: Odhlášení

source: Settings
cs: Nastavení

source: System
cs: Systém

source: Upload locally
cs: Nahrát na disk

source: Upload to SD
cs: Nahrát na SD

source: Cannot upload to printer's SD while printing
cs: Není možné nahrávat na SD kartu tiskárny dokud tiskárna tiskne

source: SD not initialized
cs: SD není inicializováno

source: Attempt to reconnect
cs: Pokouším se připojit

source: Please reload
cs: Prosím obnov stránku

source: There is a new version of the server active now, a reload of the user interface is needed. This will not interrupt any print jobs you might have ongoing. Please reload the web interface now by clicking the button below.
cs: Nyní je aktivní nová verze serveru. Je zapotřebí znovu načtení uživatelského rozhraní. Toto nepřeruší žádnou probíhající tiskovou úlohu. Prosím načtěte nyní znovu webové rozhraní stisknutím tlačítka níže.

source: Save connection settings
cs: Uložit parametry připojení

source: Auto-connect on server startup
cs: Automaticky se připojit po startu serveru

source: Refresh connection options
cs: Obnovení nastavení připojení

source: Back
cs: Zpět

source: Currently in
cs: Aktuálně v

source: Internal
cs: Vnitřní

source: Uploaded
cs: Nahráno

source: Additional data
cs: Další data

source: Load
cs: Nahrát

source: Load and Print
cs: Nahrát a tisknout

source: Free
cs: Volno

source: Total
cs: Celkem

source: Create folder...
cs: Vytvořit adresář...

source: Hint: You can also drag and drop files on this page to upload them.
cs: Tip: Pro nahrání sem také můžete přetáhnout soubory z průzkumníku vašeho PC.

source: File list settings
cs: Nastavení seznamu souborů

source: Sort by upload date
cs: Seřadit podle data

source: Sort by Folders, Files
cs: Seřadit podle Adresářů, Souborů

source: Sort by Files, Folders
cs: Seřadit podle Souborů, Adresářů

source: Mixed
cs: Smíšeně

source: Only show files stored locally
cs: Jen soubory na disku

source: Only show files stored on SD
cs: Jen soubory na SD kartě

source: Hide successfully printed files
cs: Skrýt úspěšně vytisknuté soubory

source: Refresh file list
cs: Obnovit seznam souborů

source: SD Card operations
cs: Operace s kartou SD

source: Initialize SD card
cs: Inicializovat SD kartu

source: Refresh SD files
cs: Obnovit obsah SD karty

source: Release SD card
cs: Vyjmi SD kartu

source: Current printer state
cs: Současný stav tiskárny

source: Name of file currently selected for printing
cs: Název aktuálního souboru zvoleného pro tisk

source: File
cs: Soubor

source: User who selected this file for printing
cs: Uživatel, který vybral tento soubor pro tisk

source: Current timelapse configuration
cs: Současné nastavení časosběru

source: Estimated total print time based on analysis of the file or past prints
cs: Zbývající celkový čas tisku na základě analýzy souboru nebo předcházejících tisků.

source: Approx. Total Print Time
cs: Přibližný celkový čas tisku

source: Total print time so far
cs: Celkový čas je příliš vzdálený

source: Print Time
cs: Doba probíhajícího tisku

source: Estimated time until the print job is done. This is only an estimate and accuracy depends heavily on various factors!
cs: Předpokládaná doba do konce tisku. Jedná se pouze o odhad a přesnost do značné míry závisí na různých faktorech!

source: Print Time Left
cs: Zbývající čas tisku

source: Bytes printed vs total bytes of file
cs: Vytisknuté byty proti celkovému počtu bytů souboru

source: Printed
cs: Vytisknuto

source: Print
cs: Tisknout

source: Resume
cs: Pokračovat

source: Cancels the print job
cs: Zruší tisk
