Repository: wojtas26/octoprint
Catalog: messages.po
Languages: cs

source: Please define the maximum speed/feedrate of the individual axes and whether their control should be inverted or not.
cs: Prosím nastavte maximální rychlost / rychlost posunu každé osy zvlášť, stejně jako zda je ovládání osy invertováno nebo ne.

source: Invert control
cs: Prohodit ovládání

source: This information is used for manual control via the "Control" tab. It does NOT influence already sliced files that you upload to OctoPrint!
cs: Tato informace je použita pro ruční ovládání pomocí záložky "Ovládání". NEMÁ žádný vliv na již rozřezané soubory vytvořené v jiném PC a vložené do OctoPrintu!

source: Form Factor
cs: Typ podložky

source: Rectangular
cs: Obdélníkový

source: Circular
cs: Kruhový

source: Origin
cs: Počátek

source: Heated Bed
cs: Vyhřívaná podložka

source: Heated Chamber
cs: Vyhřívaná komora

source: Please define the print volume.
cs: Prosím nastav velikost tiskového prostoru.

source: Width (X)
cs: Šířka (X)

source: Depth (Y)
cs: Hloubka (Y)

source: Diameter (X/Y)
cs: Průměr (X/Y)

source: Height (Z)
cs: Výška (Z)

source: If your printer's print head may move slightly outside the print volume (e.g. for nozzle cleaning routines) you can define a custom safe bounding box for its movements below.
cs: Pokud se tisková hlava Vaší tiskárny může hýbat mimo tiskový prostor (např. při proceduře čištění hlavy) můžete níže nastavit uživatelské omezení tiskového prostoru.

source: Custom bounding box
cs: Uživatelské omezení tiskového prostoru

source: X Coordinates
cs: Souřadnice X

source: Y Coordinates
cs: Souřadnice Y

source: Z Coordinates
cs: Souřadnice Z

source: This information is used for the temperature tab, the bounding box check, the GCODE Viewer and/or when slicing from OctoPrint. It does NOT influence already sliced files that you upload to OctoPrint!
cs: Tato informace je použita pro záložku teplot, uživatelské nastavení tiskového prostoru, GCODE náhled a/nebo pro slicování z OctoPrintu! NEMÁ žádný vliv na soubory slicované jinde a nahrané do OctoPrintu!

source: Nozzle Diameter
cs: Průměr trysky

source: Number of Extruders
cs: Počet extruderů

source: Shared nozzle
cs: Sdílená tryska

source: Check this if your printer has a single nozzle and heater shared among its extruders instead of one nozzle and heater per extruder
cs: Zaškrtněte, pokud vaše tiskárna má jedinou trysku a topnou spirálu sdílenou mezi svými extrudery namísto jedné trysky a topení pro každý extrudér

source: Please specify the nozzle offsets of the extruders relative to the first nozzle T0 <strong>if you haven't already done so in your firmware</strong>. Otherwise leave them at (0,0).
cs: Prosím zadejte odsazení trysky extruderu relativně k první trysce T0 <strong>Pokud již tak není provedeno ve Vašem firmwaru</strong>. Jinak jej ponechte na (0,0).

source: Offset
cs: Posunutí

source: This information is used for the graph and controls available in the "Temperature" tab, the GCODE viewer and when slicing from within OctoPrint. It does NOT influence already sliced files that you upload to OctoPrint!
cs: Tato informace je použita pro graf a ovládání dostupné v záložce "Teplota", GCODE prohlížeč a když se slicuje z Octoprintu. NEMÁ žádný vliv na soubory slicované jinde a nahrané do OctoPrintu!

source: Name must be set
cs: Musí být nastaveno jméno

source: Identifier
cs: Identifikátor

source: Set as default profile
cs: Nastavit jako výchozí profil

source: Edit Profile
cs: Upravit profil

source: Delete Profile
cs: Smazat profil

source: Command to restart the OctoPrint server
cs: Příkaz pro restart OctoPrint serveru

source: Command to restart the system OctoPrint is running on
cs: Příkaz pro restart operačního systému běžícího pod OctoPrintem

source: Restart system
cs: Restartovat systém

source: Command to shut down the system OctoPrint is running on
cs: Příkaz pro vypnutí operačního systému běžícího pod OctoPrintem

source: Define a check interval, a host and a port to check against. If you don't know what to set here, the default values (using Google's DNS server) should work. If you have concerns about using that, define the IP and port of a different online server that you trust and that has a high availability.
cs: Nastavte interval kontroly proti serveru a portu který chcete. Pokud nevíte co zde nastavit, výchozí hodnoty (používající DNS Server Googlu) budou fungovat. Pokud máte obavu je používat nastavte IP adresu a port jiného online serveru kterému věříte a který má také vysokou dostupnost.

source: If the connectivity check is enabled, OctoPrint will regularly check if it's connected to the internet. This is <strong>useful to prevent resource intensive operations</strong> (such as checking for updates) if it's already clear that they won't succeed anyhow.
cs: Pokud je kontrola připojení zapnuta, OctoPrint bude pravidelně kontrolovat připojení do internetu. Toto je <strong>užitečné k ušetření systémových prostředků při náročných operacích</strong> (jako jsou kontroly aktualizací) když je jasné že nemohou být úspěšné.

source: Enable regular connectivity check
cs: Zapnout pravidelnou kontrolu připojení

source: Host against which to check for internet connectivity
cs: Host proti kterému je prováděna kontrola připojení

source: Interval in which to check for internet connectivity
cs: Interval ve kterém je prováděna kontrola připojení internetu

source: Check interval
cs: Kontrolní interval

source: Port against which to check for internet connectivity
cs: Port proti kterému je prováděna kontrola připojení internetu

source: Test host & port
cs: Test serveru a portu

source: <strong>To protect against known severe issues with certain versions of third party plugins</strong>, OctoPrint supports the use of a centralized plugin version blacklist to automatically disable such plugins before they can interfere with normal operation.
cs: <strong>Chcete-li chránit před známými závažnými problémy s určitými verzemi doplňků třetích stran</strong>, podporuje aplikace OctoPrint použití centralizované černé listiny doplňků, aby se tyto verze doplňků automaticky deaktivovaly dříve, než mohou ovlivnit normální provoz.

source: Enable plugin blacklist processing on startup
cs: Zapnout kontrolu černé listiny doplňků po spuštění

source: Any changes take effect only on the next server start.
cs: Všechny změny se projeví pouze až po příštím startu serveru.

source: How long to cache the blacklist, in minutes. You should normally not have to change this.
cs: Doba mezipaměti černé listiny v minutách. Normálně není nutno toto měnit

source: Blacklist cache TTL
cs: Černá listina cache TTL

source: Plugin blacklist URL. You should normally not have to change this.
cs: Černá listina URL adres s doplňky. Normálně není třeba toto měnit.

source: Blacklist URL
cs: Černá listina URL stránek

source: Bitrate to use for encoding the timelapse video
cs: Kvalita časosběrného videa - bitrate

source: Timelapse bitrate
cs: Bitrate časosběru

source: Full path to the FFMPEG binary
cs: Plná cesta ke knihovně FFMPEG

source: Path to FFMPEG
cs: Cesta k FFMPEGu

source: Number of FFMPEG encoding threads
cs: Počet enkódovacích vláken FFMPEGu

source: FFMPEG threads
cs: Počet vláken FFMPEGu

source: Enable timelapse support
cs: Povolit podporu časosběru

source: Enable OctoPrint watermark in timelapse movies
cs: Vložit vodoznak OctoPrintu do časosběrů

source: Enable webcam support
cs: Povolit podporu webkamery

source: Flip webcam horizontally
cs: Obrátit kameru vodorovně

source: Flip webcam vertically
cs: Obrátit kameru svisle

source: Rotate webcam 90 degrees counter clockwise
cs: Otočit kameru o 90 stupňů doleva.

source: Validate SSL on snapshot URL (if applicable)
cs: Ověřte SSL u URL pro fotky (je-li k dispozici)

source: Timeout for taking a snapshot
cs: Prodleva pro snímání fotografií

source: Snapshot timeout
cs: Časový limit pro snímkování

source: URL to use for retrieving webcam snapshot images for timelapse creation
cs: URL pro získávání fotografií pro vytváření časosběrných videí

source: Snapshot URL
cs: URL pro fotky

source: Fully qualified URL, needs to be reachable by OctoPrint's server
cs: Plně nastavená adresa URL musí být dosažitelná serverem OctoPrint

source: Aspect ratio of the webcam stream, either 16:9 or 4:3
cs: Poměr stran videa webové kamery, buď 16:9 nebo 4:3

source: Stream aspect ratio
cs: Poměr stran videa

source: If the stream has a different aspect ratio than configured here it will be letterboxed.
cs: Pokud stream má jiný poměr stran než je zde nastavený, bude použit letterbox - doplnění černými pruhy.

source: Timeout after which to unload the stream if the control tab is not visible
cs: Časový limit po němž chcete zrušit stream, když ovládací okno není dostupné

source: Stream timeout
cs: Časový limit streamu

source: URL to embed into the UI for live viewing of the webcam stream
cs: URL adresa živého vysílání web kamery

source: Stream URL
cs: URL streamu web kamery

source: Needs to be reachable from the browser displaying the OctoPrint UI, used to embed the webcam stream into the page.
cs: Musí být možné stream web kamery zobrazit v prohlížeči zobrazujícím rozhraní OctoPrint, aby mohl být stream vložen do stránek OctoPrintu.

source: Webcam stream loading...
cs: Spouštění streamu z webkamery...

source: Webcam stream not loaded
cs: Stream z webkamery nebyl spuštěn

source: It might not be configured correctly or require authentication. To have this fixed, get in touch with an administrator of this OctoPrint instance.
cs: Může být nesprávně nakonfigurován nebo vyžadovat ověření. Chcete-li tuto chybu opravit, kontaktujte správce této instance OctoPrintu.

source: It might not be configured correctly or require authentication. You can change the URL of the stream under "Settings" > "Webcam & Timelapse" > "Webcam" > "Stream URL". If you don't have a webcam you can also just disable webcam support there.
cs: Nastavení pravděpodobně není správné nebo vyžaduje autorizaci. Můžete změnit URL pro stream v "Nastavení" > "Webkamera & Časosběr" > "Web kamera" > "URL streamu web kamery". Pokud nemáte web kameru, můžete zde podporu web kamery vypnout.

source: Currently configured stream URL
cs: Aktuálně nastavené URL streamu

source: Keyboard controls active
cs: Ovládání klávesnicí je aktivní

source: X Axis
cs: Osa X

source: Y Axis
cs: Osa Y

source: Page&uarr;
cs: Page Up

source: Z Axis
cs: Osa Z

source: Home X/Y
cs: Domů X/Y

source: Home Z
cs: Domů Z

source: Stepsize
cs: Velikost kroku

source: Hint: If you move your mouse over the picture, you enter keyboard control mode.
cs: Tip: Když najedeš myší na obrázek, vstoupíš do módu ovládání klávesnicí

source: Feed rate:
cs: Rychlost tisku:

source: Select Tool...
cs: Zvol nástroj...

source: Extrude
cs: Extrudovat

source: Retract
cs: Vytáhnout

source: Flow rate:
cs: Rychlost extruderu:

source: Motors off
cs: Vypnout motory

source: Fan on
cs: Zapnout ofuk

source: Fan off
cs: Vypnut ofuk

source: Previous layer
cs: Předcházející vrstva

source: Next layer
cs: Další vrstva

source: Model info
cs: Informace o modelu

source: Layer info
cs: Info o vrstvě

source: Renderer options
cs: Možnosti renderování

source: Sync with job progress
cs: Synchronizovat s tiskem

source: Center viewport on model
cs: Vycentrovat

source: Zoom in on model
cs: Zvětšit model

source: Show moves
cs: Zobrazit pohyby

source: Show retracts
cs: Zobrazit retrakce

source: Show approx. print head position
cs: Ukázat předpokládanou pozici tiskové hlavy

source: Also show previous layer
cs: Ukazovat i předchozí vrstvu

source: Also show current layer
cs: Zobrazit i současnou vrstvu

source: Also show next layer
cs: Ukazovat i následující vrstvu

source: Reload
cs: Znovu načíst

source: Show visited bounding box
cs: Zobrazit ohraničující rámeček

source: Show printed bounding box
cs: Zobrazit vytištěný ohraničující rámeček

source: Hide empty layers
cs: Skrýt prázdné vrstvy

source: Causes reload
cs: Způsobí opětovné načtení

source: Sort layers
cs: Řadit vrstvy

source: Reset options
cs: Reset nastavení

source: Note that the time and usage values in this tab are <strong>estimated</strong> by the GCODE viewer in your browser and might differ from the values <strong>estimated</strong> by the server that are displayed in the "State" and "Files" panels in the sidebar due to slightly different implementations. Also note that these <strong>estimated</strong> values may be inaccurate since they can also take information present in the GCODE file into account.
cs: Všimněte si, že hodnoty času a množství materiálu jsou <strong>odhadnuty</strong> GCODE prohlížečem ve tvém internetovém prohlížeči a mohou být rozdílné od hodnot <strong>odhadnutých</strong> serverem a zobrazených v panelech "Stav" a "Soubory" na boku stránek kvůli trochu odlišné implementaci. Také si všimněte, že <strong>odhadnuté</strong> hodnoty mohou být nepřesné, protože mohou také použit informace z GCODE souboru.

source: <p> You've selected <strong data-bind="text: selectedFile.name"></strong> for printing which has a size of <strong data-bind="text: formatSize(selectedFile.size())"></strong>. Depending on your machine this might be too large for rendering and cause your browser to become unresponsive or crash. </p> <p> Are you sure you want to visualize this file nevertheless? </p>
cs: <p> Zvolil jsi k tisku soubor <strong data-bind="text: selectedFile.name"></strong>, který má velikost <strong data-bind="text: formatSize(selectedFile.size())"></strong>. V závislosti na rychlosti vašeho stroje může trvat zobrazení dlouho nebo může program zatuhnout. </p> <p> Jsi si jistý, že soubor stejně chceš vidět? </p>

source: Yes, please visualize %(name)s regardless of its size
cs: Ano, prosím zobraz %(name)s bez ohledu na jeho velikost

source: Current actual temperature as reported by your printer
cs: Aktuální současná teplota hlášená tiskárnou

source: Current target temperature as reported by your printer
cs: Aktuální cílová teplota hlášená tiskárnou

source: Offset to apply to temperature commands sent from files
cs: Offset pro spuštění teplotních příkazů odesílaných ze souboru

source: Fine adjust: -1°C
cs: Jemné nastavení: -1°C

source: Fine adjust: +1°C
cs: Jemné nastavení: +1°C

source: Set
cs: Nastavit

source: Change Offset
cs: Změnit Offset

source: Send
cs: Odeslat

source: Autoscroll
cs: Automatické posouvání

source: Scroll to end
cs: Až na konec

source: Copy all
cs: Kopírovat vše

source: For performance reasons only a limited amount of terminal functionality is enabled right now.
cs: Z důvodu výkonu je nyní v terminálu povoleno pouze omezené množství funkcí.

source: Fake Acknowledgement
cs: Falešné potvrzení

source: If acknowledgements ("ok"s) sent by the firmware get lost due to issues with the serial communication to your printer, OctoPrint's communication with it can become stuck. If that happens, this can help. Please be advised that such occurrences hint at general communication issues with your printer which will probably negatively influence your printing results and which you should therefore try to resolve!
cs: V případě, že se ztratí odpověď ("ok") od firmware kvůli chybě v sériové komunikaci, komunikace tiskárny s OctoPrintem se zasekne. Když se to stane, tato volba může pomoci. Pozor však na to, že může ovlivnit výsledný tisk. Je lepší tedy najít příčinu chyb v komunikaci a tu opravit!

source: Force fancy functionality
cs: Vynutit všechny funkce

source: Force terminal output during printing
cs: Vynutit terminálový výstup během tisku

source: Some functionality of the terminal will be disabled if OctoPrint detects that your browser is too slow for that. You may force it back on here, but be aware that this might make your browser unresponsive.
cs: Některé funkce v terminálu nebude možné použít, pokud Octoprint zjistí, že tvůj prohlížeč je na to příliš pomalý. Tyto funkce přitom lze vynutit, počítej však s tím, že tvůj prohlížeč může přestat reagovat.

source: Take note that timelapse configuration is disabled while your printer is printing.
cs: Měj na paměti, že nastavení časosběru není při tisku aktivní.

source: Timelapse Configuration
cs: Nastavení časosběru

source: Timelapse Mode
cs: Mód časosběru

source: Note
cs: Poznámka

source: Does not work when printing from the printer's SD Card (no way to detect the change in Z reliably). Use "Timed" mode for those prints instead.
cs: Nefunguje při tisku z SD karty (nelze spolehlivě zjistit změny v ose Z). Pro takové tisky použijte spíš mód "Časovat".

source: Minimum interval
cs: Minimální interval

source: OctoPrint will rate limit snapshots to this minimum interval. This it to prevent against performance issues with vase mode/continous z prints.
cs: OctoPrint prodlouží prodlevy mezi snímky na tento minimální interval. Toto je prevence proti problémům s výkonem při tiskovém modu vázy / kontinuální pohyb v ose Z.

source: Snapshot interval
cs: Interval snímání snímků

source: Timelapse frame rate
cs: Snímková rychlost pro časosběr

source: Timelapse post roll
cs: Závěr časosběru (kolik sec filmu po tisku ještě nahrávat)

source: OctoPrint will use the final picture to add this many seconds to the end of your rendered timelapse.
cs: OctoPrint použije poslední obrázek pro přidání těchto sekund na konec vytvářeného časosběru.

source: Retraction Z-Hop
cs: Zatažení při pohybu v ose Z

source: Enter the retraction z-hop used in the firmware or the gcode file to trigger snapshots for the timelapse only if a real layer change happens. For this to work properly your retraction z-hop has to be different from your layerheight!
cs: Vložte velikost zatažení Z-Hop použitou ve firmwaru nebo v souboru gcode k aktivaci vytváření snímků pro časosběr pouze v případě, kdy se mění vrstva. Aby toto fungovalo správně, musí být zatažení Z-Hop nastaveno odlišně od výšky vrstvy!

source: Save as default
cs: Uložit jako výchozí

source: Check this to make your selected timelapse mode and options persist across restarts.
cs: Zaškrtněte toto, chcete-li nastavit režim časosběru natrvalo i po restartu.

source: You have unsaved changes. Don't forget to save them.
cs: Máte neuložené změny. Nezapomeňte je uložit.

source: Save changes
cs: Uložit změny

source: Reset to active configuration
cs: Obnovit aktivní konfiguraci

source: Timelapse not fully configured
cs: Časosběr není plně nastaven

source: The snapshot URL and/or the path to FFMPEG are missing. To have this fixed, get in touch with an administrator of this OctoPrint instance.
cs: URL adresa pro fotografie a/nebo cesta do FFMPEG chybí. Pro doplnění kontaktujte administrátora této verze OctoPrintu.

source: The snapshot URL and/or the path to FFMPEG are missing. You can change both under "Settings" > "Webcam & Timelapse" > "Timelapse". If you don't have a webcam or don't want to enable timelapse support you can also just disable it there.
cs: URL adresa pro fotografie a/nebo cesta do FFMPEG chybí. Oboje je možné změnit v "Nastavení" > "Webkamera & Časosběr" > "Nahrávání časosběru". Pokud nemáte webkameru nebo nechcete povolit nahrávaní časosběru, můžete jej zde vypnout.

source: Currently configured snapshot URL
cs: Současné nastavení URL adresy pro fotografie

source: Currently configured path to FFMPEG
cs: Současné nastavení cesty do FFMPEG

source: Finished Timelapses
cs: Ukončené časosběry

source: Sort by date
cs: Seřadit podle data

source: Unrendered Timelapses
cs: Nevytvořené časosběry

source: Frames
cs: Snímky

source: Delete unrendered timelapse
cs: Vymazat nevytvořené časosběry

source: Render timelapse
cs: Vytvořit časosběr
